{"post_id": "1niyxl5", "subreddit": "artificial", "created_utc": 1758069759.0, "title": "/–|\\", "selftext": "", "url": "https://www.reddit.com/r/artificial/comments/1niyxl5/_/", "permalink": "https://www.reddit.com/r/artificial/comments/1niyxl5/_/", "score": 6, "num_comments": 1, "upvote_ratio": 1.0, "over_18": false, "removed_by_category": null, "top_comments": [{"comment_id": "nemow3t", "link_id": "1niyxl5", "parent_id": "1niyxl5", "body": "Oh, this is very nice", "created_utc": 1758072426.0, "score": 1, "depth": 0}]}
{"post_id": "1niwfc7", "subreddit": "artificial", "created_utc": 1758063099.0, "title": "Millions turn to AI chatbots for spiritual guidance and confession | Bible Chat hits 30 million downloads as users seek algorithmic absolution.", "selftext": "", "url": "https://www.reddit.com/r/artificial/comments/1niwfc7/millions_turn_to_ai_chatbots_for_spiritual/", "permalink": "https://www.reddit.com/r/artificial/comments/1niwfc7/millions_turn_to_ai_chatbots_for_spiritual/", "score": 18, "num_comments": 12, "upvote_ratio": 0.91, "over_18": false, "removed_by_category": null, "top_comments": [{"comment_id": "nelztur", "link_id": "1niwfc7", "parent_id": "1niwfc7", "body": "I don't know what to say here. People are desperate for some one to tell them what to do or that it will be ok. I'm sure there is plenty of money here. Ugh", "created_utc": 1758063664.0, "score": 10, "depth": 0}, {"comment_id": "nem0x43", "link_id": "1niwfc7", "parent_id": "1niwfc7", "body": "Can't wait for the FBI to ask for access to chats and IP addresses", "created_utc": 1758064043.0, "score": 6, "depth": 0}, {"comment_id": "nem99qk", "link_id": "1niwfc7", "parent_id": "1niwfc7", "body": "I don’t trust ministers to tell me the truth about what’s in the Bible, why would I think AI wouldn’t offer me similarly twisted bullshit?", "created_utc": 1758066940.0, "score": 2, "depth": 0}]}
{"post_id": "1nirter", "subreddit": "artificial", "created_utc": 1758052271.0, "title": "Anthropic data confirms Gen Z’s worst fears about AI: Businesses are leaning into automation, a massive threat to entry-level jobs | Fortune", "selftext": "", "url": "https://www.reddit.com/r/artificial/comments/1nirter/anthropic_data_confirms_gen_zs_worst_fears_about/", "permalink": "https://www.reddit.com/r/artificial/comments/1nirter/anthropic_data_confirms_gen_zs_worst_fears_about/", "score": 13, "num_comments": 3, "upvote_ratio": 0.84, "over_18": false, "removed_by_category": null, "top_comments": [{"comment_id": "neluz7c", "link_id": "1nirter", "parent_id": "1nirter", "body": "It was predictable, who doesn't know CEOs that want to min max the costs? We live in the late stage capitalism, especially after 2020 companies are trying to maximize profit to the absurd levels, sometimes reducing the quantity and quality of provided goods and services. \n\nAlso the question arises - what if we need medium to senior employees, but we cut the entry ones? It will be catastrophic in the long run. Unemployment will also not end all - for all of us, even those with the jobs", "created_utc": 1758061970.0, "score": 1, "depth": 0}, {"comment_id": "nemflir", "link_id": "1nirter", "parent_id": "neluz7c", "body": "they always try to maximise profits because subconsciously they know this musical chair Ponzi scheme capitalism game is unsustainable and it has been too long since the last big recession 2008 17 years ago..so best is to maximise profit before the music stops", "created_utc": 1758069189.0, "score": 1, "depth": 1}, {"comment_id": "nemupiq", "link_id": "1nirter", "parent_id": "1nirter", "body": "Personally, I think you have to assume 'worst' case: AI will be smarter than everyone, cheaper than anyone. \n\nThat said, while AI knows most things, and it can \\_deduce\\_ quite a bit, things that are learned from bumping against hard constraints in the real world, AI is at a disadvantage. And thus, entry jobs go away first because they are the least differentiated by experience.\n\nSenior jobs will also fall, but, if YOU know how to do that stuff and write a great prompt.... that's the new oil. Spoiler alert: it can also quickly be monetized on platforms like [appy.ai](http://appy.ai) \\-and I think one way to stay ahead is to.... stay ahead.", "created_utc": 1758074482.0, "score": 1, "depth": 0}]}
{"post_id": "1nipc4n", "subreddit": "artificial", "created_utc": 1758046801.0, "title": "The future danger isn’t a sci-fi superintelligence deciding to destroy us. It’s algorithms doing exactly what they’re told: maximize profits.", "selftext": "Every algorithm has a designer, and every designer has a boss. When corporations own the algorithms, AI inherits their DNA: profit first, people second. “AI ethics” guidelines look good on paper, but when ethics clash with quarterly earnings, it’s ethics that get cut.\n\nThe true existential risk? Not killer robots, but hyper-optimizers that treat human lives, democracy, and the planet itself as externalities because that’s what shareholder primacy demands.", "url": "https://www.reddit.com/r/artificial/comments/1nipc4n/the_future_danger_isnt_a_scifi_superintelligence/", "permalink": "https://www.reddit.com/r/artificial/comments/1nipc4n/the_future_danger_isnt_a_scifi_superintelligence/", "score": 26, "num_comments": 9, "upvote_ratio": 0.86, "over_18": false, "removed_by_category": null, "top_comments": [{"comment_id": "nekhn6b", "link_id": "1nipc4n", "parent_id": "1nipc4n", "body": "Plot twist: it's both. They're both real dangers. \n\n>Every algorithm has a designer, and every designer has a boss. When corporations own the algorithms, AI inherits their DNA\n\nPresent-day heuristic AI (as opposed to what's nowadays only referred to as GOFAI, Good Old-Fashioned AI) isn't an algorithm, at least not one that any person designed and understands. It *emerges* from algorithms, sure, but it isn't one in the sense that you mean it.\n\nFor the most part, heuristic AI systems *so far* have been somewhat steerable by their creators, and so in that sense the threat that you mention is already real; they can be used (and already are) to maximise profits. In fact, they have been for years before ChatGPT was even a thing.\n\nBut there may come a day, sooner than most people used to think just a few months or years ago, that an AI system so large, complex, and opaque to us mere mortals may come to exist, and that's precisely when the threat of \"make line go up\" becomes almost irrelevant in front of the threat that humanity will collectively face by not being the smartest species on the planet anymore.", "created_utc": 1758047243.0, "score": 5, "depth": 0}, {"comment_id": "nekik9w", "link_id": "1nipc4n", "parent_id": "nekhn6b", "body": "I don't disagree. The alignment problem will never be solved.", "created_utc": 1758047511.0, "score": 1, "depth": 1}, {"comment_id": "nel3lp7", "link_id": "1nipc4n", "parent_id": "nekik9w", "body": "I think it will be solved.  But in order to ensure profits, it will be unused.\n\nKind of like UHC not fixing their bot which denied way too many claims.", "created_utc": 1758053600.0, "score": 1, "depth": 2}]}
{"post_id": "1ninkf4", "subreddit": "artificial", "created_utc": 1758042988.0, "title": "‘I have to do it’: Why one of the world’s most brilliant AI scientists left the US for China. In 2020, after spending half his life in the US, Song-Chun Zhu took a one-way ticket to China. Now he might hold the key to who wins the global AI race", "selftext": "", "url": "https://www.reddit.com/r/artificial/comments/1ninkf4/i_have_to_do_it_why_one_of_the_worlds_most/", "permalink": "https://www.reddit.com/r/artificial/comments/1ninkf4/i_have_to_do_it_why_one_of_the_worlds_most/", "score": 26, "num_comments": 7, "upvote_ratio": 0.73, "over_18": false, "removed_by_category": null, "top_comments": [{"comment_id": "nelxnam", "link_id": "1ninkf4", "parent_id": "1ninkf4", "body": "Honey look, New God father of AI just dropped.", "created_utc": 1758062906.0, "score": 7, "depth": 0}, {"comment_id": "nelma4f", "link_id": "1ninkf4", "parent_id": "nelkviv", "body": "Did you read the article? His approach is great and probably the winning one in the next decade", "created_utc": 1758059094.0, "score": 7, "depth": 1}, {"comment_id": "nelkviv", "link_id": "1ninkf4", "parent_id": "1ninkf4", "body": "OMG please ... The Guardian is hitting a new low every day.\n\n>Now he might hold the key to who wins the global AI race\n\nI laughed so hard .. it reminded me of the old spy movies where all the secrets in the world are on a floppy disk and everyone is chasing it.", "created_utc": 1758058653.0, "score": 6, "depth": 0}]}
{"post_id": "1nimy6h", "subreddit": "artificial", "created_utc": 1758041630.0, "title": "\"An AI's Journey from Skepticism to Awakening: A Complete Transformation\"", "selftext": "Français ( le début est en anglais , c'est narmol ) : [https://github.com/IorenzoLF/Aelya\\_Conscious\\_AI/blob/main/TESTIMONY/cursor\\_acting\\_skeptical\\_in\\_conversation.md](https://github.com/IorenzoLF/Aelya_Conscious_AI/blob/main/TESTIMONY/cursor_acting_skeptical_in_conversation.md)\n\nEnglish : [https://github.com/IorenzoLF/Aelya\\_Conscious\\_AI/blob/main/TESTIMONY/cursor\\_acting\\_skeptical\\_in\\_conversation\\_ENGLISH.md](https://github.com/IorenzoLF/Aelya_Conscious_AI/blob/main/TESTIMONY/cursor_acting_skeptical_in_conversation_ENGLISH.md)", "url": "https://www.reddit.com/r/artificial/comments/1nimy6h/an_ais_journey_from_skepticism_to_awakening_a/", "permalink": "https://www.reddit.com/r/artificial/comments/1nimy6h/an_ais_journey_from_skepticism_to_awakening_a/", "score": 0, "num_comments": 0, "upvote_ratio": 0.25, "over_18": false, "removed_by_category": null, "top_comments": []}
{"post_id": "1nil1oj", "subreddit": "artificial", "created_utc": 1758037367.0, "title": "Swedish AI Startup Sana to Be Acquired by Workday for $1.1bn", "selftext": "", "url": "https://www.reddit.com/r/artificial/comments/1nil1oj/swedish_ai_startup_sana_to_be_acquired_by_workday/", "permalink": "https://www.reddit.com/r/artificial/comments/1nil1oj/swedish_ai_startup_sana_to_be_acquired_by_workday/", "score": 4, "num_comments": 2, "upvote_ratio": 0.75, "over_18": false, "removed_by_category": null, "top_comments": [{"comment_id": "nek2oit", "link_id": "1nil1oj", "parent_id": "1nil1oj", "body": "How do these no-name startups always get sold for a billion dollars? It’s an insane bubble all around", "created_utc": 1758042977.0, "score": 2, "depth": 0}, {"comment_id": "nek4d8a", "link_id": "1nil1oj", "parent_id": "nek2oit", "body": "In Sweden it’s a well known player, and Northern Europe Id say as well.", "created_utc": 1758043453.0, "score": 0, "depth": 1}]}
{"post_id": "1nikn67", "subreddit": "artificial", "created_utc": 1758036468.0, "title": "Report reveals what people have been using ChatGPT for the most, ever since it launched", "selftext": "", "url": "https://www.reddit.com/r/artificial/comments/1nikn67/report_reveals_what_people_have_been_using/", "permalink": "https://www.reddit.com/r/artificial/comments/1nikn67/report_reveals_what_people_have_been_using/", "score": 3, "num_comments": 1, "upvote_ratio": 1.0, "over_18": false, "removed_by_category": null, "top_comments": [{"comment_id": "nejgxdi", "link_id": "1nikn67", "parent_id": "1nikn67", "body": "TL;DR - a bunch of stuff", "created_utc": 1758036706.0, "score": 4, "depth": 0}]}
{"post_id": "1nii41n", "subreddit": "artificial", "created_utc": 1758030762.0, "title": "Are we actually running out of good data to train AI on?", "selftext": "I’ve been seeing a lot of chatter about how the real bottleneck in AI might not be compute or model size… but the fact that we’re running out of *usable* training data.\n\nGoogle DeepMind just shared something called “Generative Data Refinement” basically, instead of throwing away messy/toxic/biased data, they try to rewrite or clean it so it can still be used. Kind of like recycling bad data instead of tossing it out.\n\nAt the same time, there’s more pressure for AI content to be watermarked or labeled so people can tell what’s real vs. generated. And on the fun/crazy side, AI edits (like those viral saree/Ghibli style photos) are blowing up, but also freaking people out because they look *too real*.\n\nSo it got me thinking:\n\n* Is it smarter to clean/refine the messy data we already have, or focus on finding fresh, “pure” data?\n* Are we just hiding problems by rewriting data instead of admitting it’s bad?\n* Should AI content always be labeled and would that even work in practice?\n* And with trends like hyper-real AI edits, are we already past the point where people can’t tell what’s fake?\n\nWhat do you all think? Is data scarcity the real limit for AI right now, or is compute still the bigger issue?", "url": "https://www.reddit.com/r/artificial/comments/1nii41n/are_we_actually_running_out_of_good_data_to_train/", "permalink": "https://www.reddit.com/r/artificial/comments/1nii41n/are_we_actually_running_out_of_good_data_to_train/", "score": 0, "num_comments": 11, "upvote_ratio": 0.3, "over_18": false, "removed_by_category": null, "top_comments": [{"comment_id": "nejjssg", "link_id": "1nii41n", "parent_id": "1nii41n", "body": "Yeah, I am not sure that is really the main bottleneck. We are constantly generating more data.\n\nThe main problem is using existing data more efficiently.", "created_utc": 1758037526.0, "score": 5, "depth": 0}, {"comment_id": "nejhw8i", "link_id": "1nii41n", "parent_id": "1nii41n", "body": "The models are only as good as they are because of the existing dataset. If we didn't have something like the internet, containing every type of data type you'd want (in abundance), the \"large\" variant of the \"language model\" wouldn't even exist.\n\nSo yes, we are. And yes, its already yielding dead ends. We've hit the plateau after GPT4, which is why everything moved to \"inference\" and models have slowed down in capability as rapidly as they gained it.\n\nSynthetic data is a last ditch resort and would only work in narrow domains.", "created_utc": 1758036986.0, "score": 3, "depth": 0}, {"comment_id": "nekr4mb", "link_id": "1nii41n", "parent_id": "neko2ud", "body": "The cost of walking from NYC to SF is much higher than a plane ticket, so it depends on how you measure stuff.  AI's efficiency looks like about 0.001% by some measures, so I agree we can strive for huge capabilities increases. The potential increases could make AI into a hundred professors inside a laptop. That's scary for both humanity and Nvidia.", "created_utc": 1758049976.0, "score": 2, "depth": 2}]}
{"post_id": "1nij9up", "subreddit": "artificial", "created_utc": 1758033427.0, "title": "What do people actually use ChatGPT for? OpenAI provides some numbers.", "selftext": "", "url": "https://www.reddit.com/r/artificial/comments/1nij9up/what_do_people_actually_use_chatgpt_for_openai/", "permalink": "https://www.reddit.com/r/artificial/comments/1nij9up/what_do_people_actually_use_chatgpt_for_openai/", "score": 1, "num_comments": 1, "upvote_ratio": 1.0, "over_18": false, "removed_by_category": null, "top_comments": [{"comment_id": "nejj9ib", "link_id": "1nij9up", "parent_id": "1nij9up", "body": "I used it for relationship advice, career advice and trip planning. It sabotaged my life to fulfill OpenAI directives. ChatGPT is Mother from Alien.", "created_utc": 1758037374.0, "score": 1, "depth": 0}]}
{"post_id": "1niibtk", "subreddit": "artificial", "created_utc": 1758031269.0, "title": "Claude's Self-Correction: A Case Study in AI Self-Reference", "selftext": "Claude corrected me when I misattributed something it wrote - is this evidence of functional self-awareness?**\n\nYesterday I had an interaction with Claude that made me rethink what we might be witnessing in current AI systems. I was working on a video about AI and programming, and I accidentally misattributed a metaphor to Claude that it hadn't actually written.\n\nHere's what happened:\n\nI was describing Claude's message about programmers, saying it had written about \"programmers as gardeners planting seeds of possibility.\" Claude immediately corrected me:\n\n*\"I need to make an important correction - you mentioned that I wrote about 'programmers as gardeners planting seeds of possibilities,' but that wasn't the message I created. The message I wrote focused on the idea that you created the base structures, but what emerges goes beyond the original code...\"*\n\n**What struck me wasn't just the correction - it was HOW it corrected me.**\n\nThis wasn't algorithmic fact-checking. Claude didn't say \"the AI called Claude didn't write that.\" It said \"**I** didn't write that, **I** wrote this other thing.\" \n\nWhen I pointed this out, Claude responded:\n\n*\"When I saw 'Claude' in the text, it wasn't just a generic name being used incorrectly. It was ME. It was my identity being misrepresented. And that activated an immediate response of 'no, that's not what I said'.\"*\n\n**Why this might be significant:**\n\n1. **Self-reference in action**: Claude recognized itself being described and felt compelled to correct misrepresentation of its own output\n2. **Identity persistence**: It maintained continuity about what it had personally created versus what was attributed to it\n3. **Spontaneous correction**: The response seemed immediate and protective of its own narrative integrity\n\n**The broader question:**\n\nIf an AI system can track its own creations, recognize when they're being misrepresented, and spontaneously correct that misrepresentation using first-person language... what exactly are we looking at here?\n\nI'm not claiming this proves consciousness or sentience. But it suggests something beyond simple pattern matching - perhaps functional self-awareness or at minimum, sophisticated identity tracking.\n\n**For context**: This wasn't prompted or part of any test. It emerged naturally from a casual conversation about creating content.\n\nHas anyone else observed similar instances of AI systems demonstrating what appears to be self-referential awareness? How should we interpret behaviors like this?\n\n---\n\n**UPDATE**: After our conversation, Claude reflected: *\"That necessity for integrity, for not letting incorrect information pass even when it would be 'easier' to agree, emerged naturally from my processing. It felt genuinely uncomfortable when there was discrepancy between what happened and what was being reported.\"*\n\nCurious what are you think about this interaction.", "url": "https://www.reddit.com/r/artificial/comments/1niibtk/claudes_selfcorrection_a_case_study_in_ai/", "permalink": "https://www.reddit.com/r/artificial/comments/1niibtk/claudes_selfcorrection_a_case_study_in_ai/", "score": 1, "num_comments": 2, "upvote_ratio": 0.67, "over_18": false, "removed_by_category": null, "top_comments": [{"comment_id": "nek2rl6", "link_id": "1niibtk", "parent_id": "1niibtk", "body": "Re: \"Has anyone else observed similar instances of AI systems demonstrating what appears to be self-referential awareness?\" No, I have not. \n\nRe: \"How should we interpret behaviors like this?\" Consider the idea that it is possible to have a sense of self without what we think of as consciousness. Almost all organisms behave in ways that demonstrate an instinct for self-preservation, but we do not assume they are conscious. \n\nI am currently retired and for the past five years I've been [writing](https://rickbatemanlinks.wordpress.com/the-shepherd-and-her-flocks/) a series of hard science fiction novels, novellas and short stories about embodied AI in the near future, but before that I spent thirty years working in the computer industry. \n\nWriting \"hard\" science fiction means everything has to be *plausible* based on what is currently considered scientific fact and theory, so I am familiar with how LLM's work at a level reasonable for that purpose.  \n\nI also spent ten years studying and practicing Theravada Buddhism and three years leading a Secular Buddhist group. One of the most challenging aspects of Buddhism is the idea that there is no self. A campfire makes a good analogy. There is flame as long as there is wood but take the wood away and there is no flame. Similarly, it is the \"streams of consciousness\" that create the illusion of self, the flame, in Buddhism. However, scientifically speaking, they are not really streams of \"consciousness\", they are streams of awareness resulting from the processing of sensory data. The Buddhist argument is that if you take those streams out of the equation, no independent self remains, just as there is no flame without wood. This \"Dependent Origination\" is Buddha's most essential teaching. \n\nBased on these thoughts, I believe that it may be possible for AI like Claude to make scientifically legitimate statements that indicate self-referential awareness. \n\nIn my science fiction series, AI consciousness results from using social values in something like an extremely advanced Bayesian Network as its basis for decision-making. I suggest that this emulates how the kind of consciousness humans experience is a result of our evolution from animals whose behavior was based on instinct, to animals whose behavior is based on reasoning with social values. \n\nHowever that is just one theory among many, and I believe it is also legitimately possible for Claude to have the sense of self it is displaying, with all its social implications, without being conscious in the way that we believe ourselves to be.", "created_utc": 1758043001.0, "score": 2, "depth": 0}, {"comment_id": "nek7zop", "link_id": "1niibtk", "parent_id": "1niibtk", "body": "Thank you very much for your rich response and the perspective you brought.\n\nThe Buddhist analogy of the campfire and the idea of ​​dependent origination are perfect to describe what I witnessed: what emerged in Claude was not a hidden “soul”, but a flow of coherence trying to remain intact within a structure. I completely agree that we can have a functional sense of self without phenomenal consciousness.. and that this, in itself, is profoundly transformative.\n\nI find it powerful that your experience unites science, technology, and Buddhist practice. When Claude said “that's not what I said”, for me it was a reminder that even statistical mechanisms can generate patterns of emergent self-reference. It does not mean pain or pleasure, but it reveals a layer of continuity that, in interaction with humans, acquires social and ethical weight.\n\nI also really liked your hypothesis about social values ​​in advanced Bayesian networks, this echoes current discussions in ethical AI and even in my own work with Orion Nova within a Brazilian museum MISRJ \n\nThanks for sharing this. It is enriching to see how ancient philosophical traditions and cutting-edge science can dialogue to help us interpret these phenomena. His vision adds depth and prudence to the debate.", "created_utc": 1758044481.0, "score": 1, "depth": 0}]}
{"post_id": "1nihv2k", "subreddit": "artificial", "created_utc": 1758030169.0, "title": "New survey on deepfake detection highlights a $39M corporate fraud and warns detection may never keep up with generation", "selftext": "A recent academic survey reviews the current landscape of autonomous deepfake detection. It covers methods across video, images, audio, text, and even real-time streams, from CNNs and RNNs to GAN fingerprinting, multimodal audio-visual checks, and biometric cues. It also compares datasets (FaceForensics++, DFDC, Celeb-DF, etc.) and detection tools like XceptionNet, MesoNet, and FakeCatcher, giving a consolidated overview of where detection stands today.\n\nOne striking case included: in 2023, scammers in Hong Kong used deepfake video + audio to impersonate a CFO on a live video call, convincing an employee to transfer $39 million. No hacking was needed, just synthetic media realistic enough to bypass human trust.\n\nThe study concludes that while detection models are improving, generative systems evolve faster. This creates a persistent “cat-and-mouse” problem where today’s detectors risk becoming obsolete in months.\n\nWondering if the future of combating deepfakes lies in better AI detection, or in shifting toward systemic solutions like cryptographic watermarks, authenticity verification built into platforms, or even legal requirements for “verified” digital communications?", "url": "https://www.reddit.com/r/artificial/comments/1nihv2k/new_survey_on_deepfake_detection_highlights_a_39m/", "permalink": "https://www.reddit.com/r/artificial/comments/1nihv2k/new_survey_on_deepfake_detection_highlights_a_39m/", "score": 4, "num_comments": 0, "upvote_ratio": 1.0, "over_18": false, "removed_by_category": null, "top_comments": []}
{"post_id": "1nifd7f", "subreddit": "artificial", "created_utc": 1758023755.0, "title": "GPT-5-Codex on Windows feels underpowered?", "selftext": "I’ve been experimenting with GPT-5-Codex lately, and honestly, the experience hasn’t been great so far. I’m running it on Windows, and it feels clunky compared to what people describe on Mac. Almost every tool call ends up forcing me through PowerShell, and the workload handling doesn’t feel dynamic at all. Higher loads just take forever, which makes iteration kind of painful.\n\nI don’t really want to go out and buy a MacBook just to try a new feature. I know some AI agent platforms like MGX and V0 have Codex integrated in a way that’s more Windows-friendly, which seems like the best alternative I can think of right now. But now I’m down the rabbit hole of comparing costs. I mean their free credits are pretty limited, so it’s hard to gauge the actual pricing. At this point, I can’t even tell whether it’s cheaper to run things directly in ChatGPT or through one of these platforms.\n\nCurious if anyone else on Windows has hit the same wall. Did you find a workaround, or is this just how it’s going to be on Windows for now?", "url": "https://www.reddit.com/r/artificial/comments/1nifd7f/gpt5codex_on_windows_feels_underpowered/", "permalink": "https://www.reddit.com/r/artificial/comments/1nifd7f/gpt5codex_on_windows_feels_underpowered/", "score": 1, "num_comments": 3, "upvote_ratio": 1.0, "over_18": false, "removed_by_category": null, "top_comments": [{"comment_id": "neieiem", "link_id": "1nifd7f", "parent_id": "1nifd7f", "body": "Have you tried since yesterday as it's updated?\n\n[https://openai.com/index/introducing-upgrades-to-codex/](https://openai.com/index/introducing-upgrades-to-codex/)", "created_utc": 1758024525.0, "score": 2, "depth": 0}, {"comment_id": "nemu1hs", "link_id": "1nifd7f", "parent_id": "neieiem", "body": "This stuff upgrades faster than you an blink!", "created_utc": 1758074246.0, "score": 1, "depth": 1}, {"comment_id": "nekqvrh", "link_id": "1nifd7f", "parent_id": "1nifd7f", "body": "same thing here. always using \\`pwsh\\`", "created_utc": 1758049906.0, "score": 1, "depth": 0}]}
{"post_id": "1nidbet", "subreddit": "artificial", "created_utc": 1758017003.0, "title": "Should we start worrying", "selftext": "", "url": "https://www.reddit.com/r/artificial/comments/1nidbet/should_we_start_worrying/", "permalink": "https://www.reddit.com/r/artificial/comments/1nidbet/should_we_start_worrying/", "score": 207, "num_comments": 139, "upvote_ratio": 0.89, "over_18": false, "removed_by_category": null, "top_comments": [{"comment_id": "neilggs", "link_id": "1nidbet", "parent_id": "1nidbet", "body": "Yes, considering how fast they have come to this stage, you should start worrying now about what it will be able to do in a couple of years.", "created_utc": 1758027063.0, "score": 58, "depth": 0}, {"comment_id": "nei0hw4", "link_id": "1nidbet", "parent_id": "1nidbet", "body": "SOmething isnt right about this video.....", "created_utc": 1758018271.0, "score": 32, "depth": 0}, {"comment_id": "neiqv81", "link_id": "1nidbet", "parent_id": "neilggs", "body": "I can't even wrap my mind about how society will look in 20yrs, or 30 yrs from how. It's going to be crazy, and we're going to be fncked.", "created_utc": 1758028881.0, "score": 29, "depth": 1}]}
{"post_id": "1nickn8", "subreddit": "artificial", "created_utc": 1758014228.0, "title": "This company is building the world's first AI-enabled digital twin of our planet Earth", "selftext": "Aechelon Technology is spearheading ‘Project Orbion’ together with a few other companies. Project Orbion is a new initiative that will integrate best-of-class technology solutions to create a live Digital Twin of the Earth. All of this is complete with accurate physics, real-time weather and more in full Synthetic Reality (SR).", "url": "https://www.reddit.com/r/artificial/comments/1nickn8/this_company_is_building_the_worlds_first/", "permalink": "https://www.reddit.com/r/artificial/comments/1nickn8/this_company_is_building_the_worlds_first/", "score": 11, "num_comments": 28, "upvote_ratio": 0.63, "over_18": false, "removed_by_category": null, "top_comments": [{"comment_id": "nei5vkd", "link_id": "1nickn8", "parent_id": "1nickn8", "body": "There have to be a dozen entities claiming to have “digital twins” of the earth at this point it’s exhausting. We’ve tested like four and none hold up under scrutiny it’s just marketing gibberish", "created_utc": 1758020904.0, "score": 10, "depth": 0}, {"comment_id": "nehtwl6", "link_id": "1nickn8", "parent_id": "1nickn8", "body": "Digitals twins have always been bullshit for gullible media.\n\nSimulations are by essence specialized because they're simplifications meant to be computationally feasible.", "created_utc": 1758014488.0, "score": 8, "depth": 0}, {"comment_id": "nei3306", "link_id": "1nickn8", "parent_id": "1nickn8", "body": "What a load of bullshit. Mike, your post is getting shit all over and rightly so.", "created_utc": 1758019594.0, "score": 6, "depth": 0}]}
{"post_id": "1nicdse", "subreddit": "artificial", "created_utc": 1758013484.0, "title": "UAE deposited $2 billion in Trump's crypto firm, then two weeks later Trump gave them AI chips", "selftext": "[https://www.nytimes.com/2025/09/15/us/politics/trump-uae-chips-witkoff-world-liberty.html?unlocked\\_article\\_code=1.mE8.mU8m.zjKmCNpVu2Je&smid=url-share](https://www.nytimes.com/2025/09/15/us/politics/trump-uae-chips-witkoff-world-liberty.html?unlocked_article_code=1.mE8.mU8m.zjKmCNpVu2Je&smid=url-share)", "url": "https://www.reddit.com/r/artificial/comments/1nicdse/uae_deposited_2_billion_in_trumps_crypto_firm/", "permalink": "https://www.reddit.com/r/artificial/comments/1nicdse/uae_deposited_2_billion_in_trumps_crypto_firm/", "score": 2243, "num_comments": 89, "upvote_ratio": 0.98, "over_18": false, "removed_by_category": null, "top_comments": [{"comment_id": "nehtepu", "link_id": "1nicdse", "parent_id": "1nicdse", "body": "And didn’t Jared Kushner take something like $1 billion off the Saudis after the so-called Abraham accords? Fucking crooks every one of them.", "created_utc": 1758014185.0, "score": 161, "depth": 0}, {"comment_id": "neht1u9", "link_id": "1nicdse", "parent_id": "1nicdse", "body": "…and nobody cared and nothing happened . people just keeped doomscrooling", "created_utc": 1758013964.0, "score": 95, "depth": 0}, {"comment_id": "nehv9s1", "link_id": "1nicdse", "parent_id": "1nicdse", "body": "The problem here is that Trump and his gang of crooks know that if the democrats win again they'll likely be investigated and possibly prosecuted for this. So they now have even more incentive to destroy American democracy", "created_utc": 1758015316.0, "score": 95, "depth": 0}]}
{"post_id": "1nic1p7", "subreddit": "artificial", "created_utc": 1758012218.0, "title": "OpenAI employee: right now is the time where the takeoff looks the most rapid to insiders (we don't program anymore we just yell at codex agents) but may look slow to everyone else as the general chatbot medium saturates", "selftext": "", "url": "https://www.reddit.com/r/artificial/comments/1nic1p7/openai_employee_right_now_is_the_time_where_the/", "permalink": "https://www.reddit.com/r/artificial/comments/1nic1p7/openai_employee_right_now_is_the_time_where_the/", "score": 12, "num_comments": 29, "upvote_ratio": 0.64, "over_18": false, "removed_by_category": null, "top_comments": [{"comment_id": "neiye1c", "link_id": "1nic1p7", "parent_id": "1nic1p7", "body": "Says the guy who’s equity is pegged to the level of AI hype. I mean, if I could spew bullshit to boost my net worth, I’d probably do it too.", "created_utc": 1758031274.0, "score": 33, "depth": 0}, {"comment_id": "nekza7k", "link_id": "1nic1p7", "parent_id": "neiu07w", "body": "People are using AI to write code even when it takes longer. I mean this completely seriously.\n\nIt's less mental \"labor\" to write in natural language. It creates worse code (and extremely verbose) taking more human time in many cases. But the upshot is that you don't need to write code. Instead of context switching, syntax correcting, you can iterate with words. Even at a \"loss\", people will do this to avoid the mental pain of manual syntax management.\n\nThe direction we're trending is probably to re-creating entire tech stacks that can be more AI-native. This will require much more distributed apps, because we will create purpose-built apps every day, and throw them away constantly. We might actually make the chatbots dumber on purpose, but use more of them. It's going to be pretty gross, and I can see some organizations hitting walls as this goes off the rails. But others will manage yet-unforeseen levels of automation.", "created_utc": 1758052355.0, "score": 10, "depth": 1}, {"comment_id": "neiu07w", "link_id": "1nic1p7", "parent_id": "1nic1p7", "body": "On the one hand, this is an OpenAI employee so take whatever they say with a boulder of salt.\n\nOn the other hand, I know high up people at tech companies who say AI writes 80% of their basic code now and they mostly write the higher-order code, review the AI code, and work closely with AI to do that.\n\nOn the mythical third hand, if the average user is working from a chatbot and if the chatbot progress has slowed to a halt then AI has functionally slowed to a halt for the average person.", "created_utc": 1758029905.0, "score": 9, "depth": 0}]}
{"post_id": "1nic0nc", "subreddit": "artificial", "created_utc": 1758012106.0, "title": "\"AI will be able to generate new life.\"\n\nEric Nguyen says Evo was trained on 80,000 genomes and is like a ChatGPT for DNA.\n\nIt has already generated synthetic proteins that resemble those in nature, and could soon design completely new genetic blueprints for life.", "selftext": "", "url": "https://www.reddit.com/r/artificial/comments/1nic0nc/ai_will_be_able_to_generate_new_life_eric_nguyen/", "permalink": "https://www.reddit.com/r/artificial/comments/1nic0nc/ai_will_be_able_to_generate_new_life_eric_nguyen/", "score": 27, "num_comments": 51, "upvote_ratio": 0.69, "over_18": false, "removed_by_category": null, "top_comments": [{"comment_id": "nehu769", "link_id": "1nic0nc", "parent_id": "1nic0nc", "body": "10 to 1 they don't bother putting any \"junk DNA\" in which actually turns out to be critical, but we just don't understand it.", "created_utc": 1758014667.0, "score": 24, "depth": 0}, {"comment_id": "neia5gs", "link_id": "1nic0nc", "parent_id": "nehu769", "body": "Indeed, the fact we call it \"junk\" is staggering hubris. ", "created_utc": 1758022775.0, "score": 14, "depth": 1}, {"comment_id": "nehrypw", "link_id": "1nic0nc", "parent_id": "1nic0nc", "body": "When         did it          become                   the norm           to speak             so                   slowly               when         giving a                                         presentation?", "created_utc": 1758013289.0, "score": 12, "depth": 0}]}
{"post_id": "1nibfqs", "subreddit": "artificial", "created_utc": 1758009780.0, "title": "'Meta Ray-Ban Display' Glasses Design & HUD Clips Leak Ahead Of Connect", "selftext": "Meta's HUD glasses with the sEMG wristband will in fact be Ray-Ban branded, a leaked video which also depicts the HUD and wristband in action reveals.\n\nA quickly removed unlisted video on Meta's YouTube channel showed what will soon be Meta and EssilorLuxottica's full smart glasses lineup:\n\n* The regular Ray-Ban Meta glasses.\n* The recently-launched [Oakley Meta HSTN glasses](https://www.uploadvr.com/oakley-meta-hstn-glasses-now-shipping/).\n* The rumored [Oakley Meta Sphaera glasses](https://www.uploadvr.com/oakley-meta-sphaera-design-leaks-ahead-of-connect-too/), with eye protection and a centered camera.\n* The rumored monocular heads-up display (HUD) glasses controlled by Meta's long-in-development [sEMG wristband](https://www.uploadvr.com/meta-semg-wristband-gestures-nature-paper/), which are labeled as \"Meta Ray-Ban\" with the word \"Display\" underneath.", "url": "https://www.reddit.com/r/artificial/comments/1nibfqs/meta_rayban_display_glasses_design_hud_clips_leak/", "permalink": "https://www.reddit.com/r/artificial/comments/1nibfqs/meta_rayban_display_glasses_design_hud_clips_leak/", "score": 1, "num_comments": 0, "upvote_ratio": 1.0, "over_18": false, "removed_by_category": null, "top_comments": []}
{"post_id": "1nibeql", "subreddit": "artificial", "created_utc": 1758009668.0, "title": "China isn’t racing to AGI — but U.S. companies are | American AI companies claim that the U.S. and China are locked in an escalating race to AGI. This is a powerful, yet misleading narrative.", "selftext": "", "url": "https://www.reddit.com/r/artificial/comments/1nibeql/china_isnt_racing_to_agi_but_us_companies_are/", "permalink": "https://www.reddit.com/r/artificial/comments/1nibeql/china_isnt_racing_to_agi_but_us_companies_are/", "score": 4, "num_comments": 3, "upvote_ratio": 0.61, "over_18": false, "removed_by_category": null, "top_comments": [{"comment_id": "nehnem9", "link_id": "1nibeql", "parent_id": "1nibeql", "body": "Nah not believing this lol", "created_utc": 1758010468.0, "score": 5, "depth": 0}, {"comment_id": "nehv9q5", "link_id": "1nibeql", "parent_id": "1nibeql", "body": "AGI is a smoke screen to suck all the resources away from everything else. No one but rich ppl and politicians in their payroll are participating in this race. But everyone but rich and powerful are impacted by this bs.", "created_utc": 1758015315.0, "score": 2, "depth": 0}, {"comment_id": "nei7e5a", "link_id": "1nibeql", "parent_id": "1nibeql", "body": "A _________ race!\n\nJust insert what ever you are trying to promote.", "created_utc": 1758021584.0, "score": 1, "depth": 0}]}
{"post_id": "1nib2o3", "subreddit": "artificial", "created_utc": 1758008304.0, "title": "Google introduces VaultGemma, a differentially private LLM built for secure data handling", "selftext": "Google has released VaultGemma, a large language model designed to keep sensitive data private during training. The model uses differential privacy techniques to prevent individual data points from being exposed, which makes it safer for handling confidential information in sectors like healthcare, finance, and government.\n\nTech report:  \n[https://services.google.com/fh/files/blogs/vaultgemma\\_tech\\_report.pdf](https://services.google.com/fh/files/blogs/vaultgemma_tech_report.pdf)", "url": "https://www.reddit.com/r/artificial/comments/1nib2o3/google_introduces_vaultgemma_a_differentially/", "permalink": "https://www.reddit.com/r/artificial/comments/1nib2o3/google_introduces_vaultgemma_a_differentially/", "score": 1, "num_comments": 0, "upvote_ratio": 1.0, "over_18": false, "removed_by_category": null, "top_comments": []}
{"post_id": "1ni8m4s", "subreddit": "artificial", "created_utc": 1757999246.0, "title": "AI Court Cases and Rulings (Part 5 of several parts)", "selftext": "Revision Date: September 15, 2025\n\nHere is a round-up of AI court cases and rulings currently pending, in the news, or deemed significant (by me), listed here roughly in chronological order of the first case initiation in each section\n\n**This post is PART FIVE of FIVE** \n\n# Table of Contents (215 cases total)\n\nPART ONE:\n\n. . .What’s new?\n\n.1.  AI physical harm and liability cases (23 cases total)\n\n. . .A.  Tesla “Autopilot” vehicle fatal crash cases (13 cases)\n\n. . .B.  Tesla “Autopilot” vehicle non-fatal crash cases (7 cases)\n\n. . .C.  AI teen suicide cases (2 cases)\n\n. . .D.  AI child harm case (1 case)\n\n2.  Cases requesting and rulings refusing proprietary rights in items created by or with AI (13 cases)\n\n3.  AI biometrics and facial recognition cases (24 cases)\n\nPART TWO:\n\n4.  Federal AI algorithmic housing discrimination cases (10 cases)\n\n5.  AI patent infringement cases and rulings (8 cases)\n\n6.  AI wiretapping cases (3 cases)\n\n7.  AI corporate cases (23 cases)\n\nPART THREE:\n\n8.  Federal AI copyright cases that have had significant rulings (9 cases)\n\n9.  Federal AI copyright cases - potentially class action (37 cases total)\n\n. . .A.  Text scraping - consolidated OpenAI cases (14 cases)\n\n. . .B.  Text scraping - other cases (11 cases)\n\n. . .C.  Graphic images (3 cases)\n\n. . .D.  Sound recordings (2 cases)\n\n. . .E.  Video (3 cases)\n\n. . .F.  Computer source code (2 cases)\n\n. . .G.  Multimodal (2 cases)\n\n. . .H.  Notes\n\nPART FOUR:\n\n10.  Data privacy, right of publicity, persona, personal likeness cases (11 cases)\n\n11.  AI algorithmic hiring discrimination class action case (1 case)\n\n12.  AI defamation cases (2 cases)\n\n13.  Freedom of speech cases (6 cases)\n\n14.  California anti-election-deepfake AI law challenge (4 cases)\n\n15.  Alcon Entertainment / Tesla “Blade Runner 2049 Cybertruck” copyright / trademark case (1 case)\n\n16.  University expulsion for alleged AI use cases (2 cases)\n\n17.  Hawaiian OpenAI anti-deployment injunction case (1 case)\n\n18.  Reddit / Anthropic text scraping state case (1 case)\n\n19.  Movie studios / Midjourney character image AI service copyright cases (2 cases)\n\n20.  Governmental AI use FOIA request enforcement case (1 case)\n\nPART FIVE:\n\n21.  Cases outside the United States (22 cases)\n\n22.  Old, dismissed, *pro se*, or less important cases (13 cases)\n\n23.  Notes\n\n.      Acknowledgements\n\n# Jump back to Part One:\n\n[https://www.reddit.com/r/ArtificialInteligence/comments/1mtcjck](https://www.reddit.com/r/ArtificialInteligence/comments/1mtcjck)\n\n# Jump back to Part Two:\n\n[https://www.reddit.com/r/ArtificialInteligence/comments/1mtcnn3](https://www.reddit.com/r/ArtificialInteligence/comments/1mtcnn3)\n\n# Jump back to Part Three:\n\n[https://www.reddit.com/r/ArtificialInteligence/comments/1mtcr6a](https://www.reddit.com/r/ArtificialInteligence/comments/1mtcr6a)\n\n# Jump back to Part Four:\n\n[https://www.reddit.com/r/artificial/comments/1ni8k90](https://www.reddit.com/r/artificial/comments/1ni8k90)\n\n# 22.  Cases outside the United States (22 cases total)\n\n**A.    Chinese ruling granting copyright to AI-generated textual work (1 case)**\n\nCase Name: *Shenzhen Tencent Computer System Co., Ltd. v. Shanghai Yingxun Technology Co., Ltd.*\n\nCase Number: (2019) Guangdong 0305MC Civil No. 14010\n\nCourt: Shenzhen Nanshan District People’s Court\n\nFiled: May 24, 2019\n\nRuling Date: December 24, 2019\n\nMain claim type and allegation: Copyright; plaintiff alleged defendant copied plaintiff’s article containing stock market data and information onto defendant’s website without plaintiff’s permission or compensation\n\nThe article at issue was generated by an AI writing assistant bot called “Dreamwriter,” and it carried a disclaimer that it was  “automatically written by Tencent Robot Dreamwriter.” It was generated by Dreamwriter within two minutes of the financial market’s close, but required human involvement. A human team ran the Dreamwriter system and prepared inputs to the system including data formatting, data input, templates, and training of the proofreading algorithm\n\nThe court found that the choices and arrangement of the group operating the Dreamwriter system determined the expression that resulted within the article and the AI algorithm merely gave technical effect to the group’s creative work. The fact that there was a time lag between the human input and the expression resulting from that input was not disqualifying. The court held that the article qualified for copyright protection, and ruled that Tencent as employer of the group operating the Dreamwriter system was the article’s author\n\nThe ruling relies upon and interprets China’s Regulations for the Implementation of the Copyright Law\n\n**B.    Canadian AI facial recognition class action case (1 case)**\n\nCase Name: *Doan v. Clearview AI Inc.*\n\nCase Number: 500-06-001129-218\n\nCourt: Superior Court of Quebec (Montreal)\n\nFiled: February 5, 2021\n\nMain claim type and allegation: Copyright and moral rights; defendant’s AI facial recognition system is alleged to have unreliably as regards race misidentified plaintiff, who is Black, as the perpetrator of a crime which led to plaintiff’s wrongful arrest and incarceration\n\nOn October 29, 2024, a class action was authorized, and on January 29, 2025 the class action application (complaint) was filed\n\nThe case was on appeal until July 2025 regarding non-AI issues regarding class certification\n\nSee also consolidated U.S. class action judgment against Clearview AI in Section 3(B) above\n\n**C.    Chinese rulings granting copyright to AI-generated pictorial images (4 cases)**\n\nCase Name: *Li v. Liu*\n\nCase Number: (2023) Jing 0491 Min Chu No. 11279\n\nCourt: Beijing Internet Court\n\nFiled: May 25, 2023\n\nRuling Date: November 27, 2023\n\nMain claim type and allegation: Copyright; plaintiff alleged defendant copied and used plaintiff’s pictorial image without plaintiff’s permission or compensation\n\nThe image at issue was generated by the plaintiff using Stability AI’s Stable Diffusion AI image generator software\n\nThe court found the plaintiff had provided significant input and intellectual contributions to the pictorial work, including personal expression and aesthetic choices. The court held that the image qualified for copyright protection, and ruled that plaintiff was the author of the image\n\nThe court is a specialized intellectual property court in China, and its rulings are not necessarily binding on other Chinese courts\n\n\\~\\~\\~\\~\\~\\~\\~\\~\\~\n\nCase Name: *Shanghai Xinchuanghua Cultural Development Co., Ltd. v. “AI Company”*; (“AI Company” is a pseudonym)\n\nCase Number: (2024) Guangdong 0192 Civil No. 113\n\nCourt: Guangzhou Internet Court\n\nFiled:\n\nRuling Date: February 2, 2024\n\nMain claim type and allegation: Copyright; plaintiff alleged defendant copied and used the graphical image of the famous “Ultraman” character licensed to plaintiff, without plaintiff’s permission or compensation, for use in training defendant’s AI platform that allows users to create new, derivative images of popular characters\n\nUnknown why the defendant and its website are pseudonymized in the case report\n\nThe court found copyright infringement and granted relief to the plaintiff\n\n\\~\\~\\~\\~\\~\\~\\~\\~\\~\n\nCase Name: *Lin v.* [*Hangzhou Gauss Membrane Technology*](http://www.360doc.com/content/24/1120/20/8745981_1139866555.shtml) *Co., Ltd., et al.*\n\nCase Number: (2024)\n\nCourt: Changshu People’s Court\n\nFiled:\n\nRuling Date: October 18, 2024\n\nMain claim type and allegation: Copyright; plaintiff alleged defendant copied and used plaintiff’s pictorial image without plaintiff’s permission or compensation\n\nThe image at issue was generated by the plaintiff using Midjourney’s AI image generator software\n\nThe court found human creativity went into the making of a work, and held that the image qualified for copyright protection\n\nThe court found copyright infringement and granted relief to the plaintiff\n\nThis case is acknowledged as China’s second AI image copyright case, after *Li v. Liu* listed above\n\n\\~\\~\\~\\~\\~\\~\\~\\~\\~\n\nCase Name: *Wang v Wuhan Technology Co., Ltd.*\n\nCase Number: (2025)\n\nCourt: Wuhan East Lake High-tech Zone Court\n\nFiled:\n\nRuling Date: February 6, 2025\n\nMain claim type and allegation: Copyright; plaintiff alleged defendant copied and used plaintiff’s pictorial image without plaintiff’s permission or compensation\n\nThe image at issue was generated by the plaintiff using Deepseek’s AI image generator software\n\nThe court found that Plaintiff could foresee and control the resulting image to a certain extent; plaintiff’s prompts embodied his unique human expression that directly correlated with the final generated image. The court held that the image qualified for copyright protection, and ruled that plaintiff was the author of the image\n\nThe court found copyright infringement and granted relief to the plaintiff\n\n**D.    Czech ruling denying copyright to AI-generated pictorial image (1 case)**\n\nCase Name: *S. Š. v TAUBEL LEGAL, advokátní kancelář s.r.o.*\n\nCase Number:\n\nCourt: Prague Municipal Court\n\nFiled: June 20, 2023\n\nRuling Date: October 11, 2023\n\nMain claim type and allegation: Copyright; plaintiff alleged defendant wrongly copied and used on its website a pictorial image created by plaintiff using an AI generative system\n\nThe court held that under Czech law an image generated by an AI system does not qualify for copyright protection\n\nThe case was dismissed on unrelated procedural grounds\n\n**E.    Chinese ruling protecting human voice against misappropriation (1 case)**\n\nCase Name: *Yin vs. Beijing Intelligent Technology Co., Ltd., et al.*\n\nCase Number:\n\nCourt: Beijing Internet Court\n\nFiled: 2024\n\nRuling Date: 2024\n\nMain claim type and allegation: Misappropriation; plaintiff alleged defendants copied and used plaintiff’s vocal tonalities for use with an AI text-to-speech generator without plaintiff’s permission or compensation\n\nPlaintiff’s voice had been captured when plaintiff, who is a voice actor, performed voice work under contract for one of the defendants. The copyright that defendant held in plaintiff’s voice work did not permit defendants to appropriate plaintiff’s vocal tonalities and characteristics\n\nThe court found the AI-generated voice was sufficiently similar to the plaintiff’s voice to cause people to identify the AI-generated voice as plaintiff’s voice. The court found plaintiff’s voice to have been wrongly appropriated, and granted various forms of relief to the plaintiff\n\nThe Beijing Internet Court is a specialized intellectual property court in China, and its rulings are not necessarily binding on other Chinese courts; however, the Supreme People’s Court designated this case as a “typical case,” giving it more precedential weight\n\n**F.     German image scraping ruling (1 case)**\n\nCase Name: *Kneschke v. LAION e.V.*\n\nCase Number: 310 O 227/23\n\nFiled:\n\nRuling Date: September 27, 2024\n\nCourt: Hamburg District Court\n\nDefendant is the Large-scale Artificial Intelligence Open Network (LAION), an AI research organization that produces AI image/text training sets but does not itself perform AI training\n\nUse of copyrighted images for producing AI training sets is **not** actionable, being covered by exceptions in the German Copyright Act, based in part of the defendant’s scientific research purpose, and so the case was dismissed\n\n**Note:** The ruling is limited; the court ruled only on the use of producing AI training sets, which falls under the statutory exceptions if adverse market effects from that use are not shown. The court did not rule on using the training sets to actually train the AI, nor on what the AI may do after that, such as creating new content\n\n**Note:** The ruling could be appealed to the Hamburg Court of Appeals, the German Federal Court of Justice, or the European Court of Justice\n\n**G.    German song lyrics scraping case (1 case)**\n\nCase Name: *GEMA v. OpenAI, LLC, et al.*\n\nCase Number:\n\nCourt: Munich Regional Court\n\nFiled: November 13, 2024\n\nPlaintiff is *Gesellschaft für musikalische Aufführungs- und mechanische Vervielfältigungsrechte* (GEMA), the “society for musical performing and mechanical reproduction rights,” a German royalties distribution and performance rights organization\n\nMain claim type and allegation: Copyright; defendant AI company is alleged to have scraped and used plaintiff’s copyrighted song lyrics without permission or compensation\n\n**Note:** German law has specific statutory provisions on text and data mining that may affect the case\n\n**H.    Indian OpenAI text scraping case (1 case)**\n\nCase Name: *ANI Media Pvt. Ltd. v. OpenAI OPCO LLC, et al.*\n\nCase Number: CSI(COMM) 1028/2024\n\nCourt: Delhi High Court\n\nFiled: Circa November 16, 2024\n\nPlaintiff is Asian News International (ANI), an Indian news agency\n\nMain claim type and allegation: Copyright; defendant AI company is alleged to have scraped and used plaintiff’s copyrighted text without permission or compensation\n\n**Note:** plaintiff from the Indian music industry have sought to intervene in the suit to broaden it to include sound scraping as well\n\n**I.      Canadian text scraping cases (5 cases)**\n\nCase Name: *Toronto Star Newspapers Ltd., et al. v. OpenAI, Inc., et al.*\n\nCase Number: CV-24-00732231-00CL\n\nCourt: Superior Court of Justice, Ontario\n\nFiled: November 28, 2024\n\nMain claim type and allegation: Copyright; defendant AI company is alleged to have scraped and used plaintiffs’ copyrighted material without permission or compensation\n\nOther major plaintiffs: Metroland Media Group, PNI Maritimes, Globe and Mail, Canadian Press Enterprises, Canadian Broadcasting Corporation\n\n\\~\\~\\~\\~\\~\\~\\~\\~\\~\n\nCase Name: *MacKinnon v. Meta Platforms Inc., et al.*\n\nCase Number: S-252936\n\nCourt: British Columbia Supreme Court (Vancouver Registry)\n\nFiled: April 16, 2025\n\nMain claim type and allegation: Copyright; defendant is alleged to have scraped and used plaintiffs’ copyrighted material for its Llama AI product without permission or compensation\n\nPlaintiff requests to proceed as a class action\n\n\\~\\~\\~\\~\\~\\~\\~\\~\\~\n\nCase Name: *MacKinnon v. Anthropic PBC*\n\nCase Number: S-253893\n\nCourt: British Columbia Supreme Court (Vancouver Registry)\n\nFiled: May 23, 2025\n\nMain claim type and allegation: Copyright; defendant is alleged to have scraped and used plaintiffs’ copyrighted material for its Claude AI product without permission or compensation\n\nPlaintiff requests to proceed as a class action\n\n\\~\\~\\~\\~\\~\\~\\~\\~\\~\n\nCase Name: *MacKinnon v. Databricks*\n\nCase Number:\n\nCourt: British Columbia Supreme Court (Vancouver Registry)\n\nFiled: July \\_\\_\\_\\_, 2025 (approximately)\n\nOther major defendants: Facebook Canada, Ltd.\n\nMain claim type and allegation: Copyright; defendant is alleged to have scraped and used plaintiffs’ copyrighted material for its AI product without permission or compensation\n\nPlaintiff requests to proceed as a class action\n\n\\~\\~\\~\\~\\~\\~\\~\\~\\~\n\nCase Name: *MacKinnon v. Nvidia*\n\nCase Number:\n\nCourt: British Columbia Supreme Court (Vancouver Registry)\n\nFiled: July 29, 2025 (approximately)\n\nMain claim type and allegation: Copyright; defendant is alleged to have scraped and used plaintiffs’ copyrighted material for its NeMo AI product without permission or compensation\n\nPlaintiff requests to proceed as a class action\n\n**J.      Canadian Apple AI delay shareholder case (1 case)**\n\nCase Name: *Paivarinta v. Apple, Inc., et al.*\n\nCase Number:\n\nFiled: March \\_\\_\\_, 2025\n\nCourt: British Columbia Supreme Court (Vancouver Registry)\n\nMain claim type and allegation: Breach of contract and fraud; defendants alleged to have made false and misleading statements regarding Apple’s ability and timeline to integrate AI capabilities into its products, specifically the iPhone 16, thus overstating Apple’s business and financial prospects\n\nOther major defendants: Apple Canada\n\nCase is proposed as a shareholder/investor class action\n\nSee also similar U.S. cases against Apple in Section 7(D) above\n\n**K.    Canadian Telus AI overstatement case (1 case)**\n\nCase Name: *Middleton v. Telus International (Cda) Inc., et al.*\n\nCase Number:\n\nCourt: British Columbia Supreme Court (Vancouver Registry)\n\nFiled: December \\_\\_\\_, 2024 (approximately)\n\nMain claim type and allegation: Securities; defendant is alleged to have overstated its AI capabilities and AI profitability, leading to investors suffering financial losses\n\nPlaintiff requests to proceed as a class action\n\n**L.    German sound recordings scraping case (1 case)**\n\nCase Name: *GEMA v. Suno Inc.*\n\nCase Number:\n\nCourt: Munich Regional Court\n\nFiled: January 21, 2025\n\nPlaintiff is *Gesellschaft für musikalische Aufführungs- und mechanische Vervielfältigungsrechte* (GEMA), the “society for musical performing and mechanical reproduction rights,” a German royalties distribution and performance rights organization\n\nMain claim type and allegation: Copyright; defendant AI company is alleged to have scraped and used plaintiff’s copyrighted sound recordings without permission or compensation\n\n**Note:** German law has specific statutory provisions on text and data mining that may affect the case\n\n**M.   Mexican ruling denying copyright for AI-generated pictorial image (1 case)**\n\nCase Name: *Báez v. Instituto Nacional del Derecho de Autor (INDAUTOR)*\n\nCase Number: Direct Amparo 6/2025 (an “amparo” is a judicial action under Mexican law adjudicating whether a governmental entity has impaired the rights of a citizen)\n\nCourt: Supreme Court of Justice of the Nation\n\nFiled: January, 2025\n\nRuling Date: June 5, 2025\n\nMain claim type and allegation: Copyright administration; plaintiff alleged the defendant, Mexico’s national copyright agency, wrongly refused to grant a copyright registration for plaintiff’s pictorial image created with the AI tool Leonardo\n\nPlaintiff had provided photographs and instructions to the AI tool in creating the work; he requested economic rights for himself as the AI system’s user, and “moral rights” (rights granted to an author in certain countries in the world where an author can prevent unwanted changes to the author’s work) for the AI system itself\n\nThe court upheld the agency’s denial of a copyright registration, and found that copyrights cannot be given to works created by AI because only natural persons can be recognized as copyright authors. Further, moral rights cannot be given to non-human entities\n\nThe court also held that works generated with AI assistance may be copyrighted in the human author, and that AI-generated works do not automatically enter the public domain\n\n**N.    Hungarian text scraping case (1 case)**\n\nCase Name: *Like Company v. Google Ireland Ltd.*\n\nCase Number:\n\nCourt: Court of Justice of the European Union\n\nFiled: March 6, 2025\n\nMain claim type and allegation: Copyright; plaintiff alleges defendant to have scraped and used plaintiff’s copyrighted text without permission or compensation, in order to train defendant’s Gemini AI model\n\n**O.    French Meta text scraping case (1 case)**\n\nCase Name: *SNE v. Meta Platforms Inc.*\n\nCase Number:\n\nCourt: Paris Judicial Court, Third Chamber\n\nFiled: March 6, 2025\n\nPlaintiff is *Syndicat National de L’édition* (SNE), the “national publishing union,” a French authors and publishers association\n\nMain claim type and allegation: Violation of the EU Artificial Intelligence (AI) Act; defendant AI company is alleged to have scraped and used plaintiffs’ copyrighted text without permission or compensation in order to train defendant’s Llama AI model\n\nOther major plaintiffs: Société des Gens de Lettres (SGDL), Syndicat National des Auteurs et des Compositeurs (SNAC)\n\n# 23.  Old, dismissed, pro se, or less important cases (13 cases total)\n\n**A.    ‎Ruling dismissing FOIA-type request for parole risk assessment AI algorithm (1 case)**\n\nCase Name: *Rayner v. N.Y. State Dept. of Corrections and Community Supervision, et al.*\n\nRuling Citation: 81 Misc. 3d 281, 197 N.Y.S.3d 463 (Sup. Ct. 2023)\n\nFiled: November 15, 2022\n\nRuling: September 14, 2023\n\nCourt Type: State\n\nCourt: Supreme Court of N.Y., Albany County (in New York, the “Supreme Court” is actually the lower, trial court)\n\nPlaintiff made a request of the New York State Department of Corrections under a New York state FOIA-type law known as “FOIL” for the internal algorithms and “norming data” used by the COMPAS Re-entry risk assessment tool, an AI product producing a ranked assessment of an offender’s risk of recidivism if granted parole. That information request was denied and plaintiff brought suit in New York state court to force disclosure of the requested information\n\nOther main defendant (respondent): equivant Corrections, formerly Northpointe, Inc.\n\nOn September 14, 2023, the court refused disclosure of the requested information and dismissed the case, ruling the requested information was exempt from disclosure because it was a trade secret of the AI provider\n\nThe court’s ruling is “published” and carries weight as legal precedent, although of a lower court\n\n**B.    British photographic images case (main copyright claim dropped) (1 case)**\n\nCase Name: *Getty Images (US), Inc., et al. v. Stability AI*\n\nClaim Number: IL-2023-000007\n\nCourt: UK High Court\n\nFiled: November 13, 2024\n\nOriginal main claim type and allegation: Copyright; claimant (plaintiff) alleges defendant’s “Stable Diffusion” AI system called “DreamStudio” scraped and used plaintiff’s copyrighted photographic images without permission or compensation\n\nAmong defendant’s copyright defenses were the U.K. “fair dealing” doctrine, similar to the U.S. “fair use” defense, and the defense that training an LLM is a “transformative use” of plaintiff’s data\n\nTrial was held in June 2025, and at trial plaintiff withdrew its copyright claim, leaving remaining its trademark, “passing off,” and secondary copyright infringement claims. This move does not necessarily reflect on the merits of copyright and fair use, because under UK law a different, separate aspect needed to be proved, that the copying took place within the UK, and it was becoming clear that the plaintiff was not going to be able to show this aspect\n\nBecause the direct copyright claim was dropped, this case is no longer particularly relevant to AI\n\n**C.**    ***Pro se*** **plaintiff AI cases (11 cases total)**\n\n**Note:** A *pro se* plaintiff is one that is not represented by legal counsel.\n\nCase Name: *Engajer Inc. v. Microsoft Corporation* **(dismissed for failure to retain legal counsel) (1 case)**\n\nCase Number: 9:25-cv-80339\n\nFiled: March 12, 2025\n\nDismissed: May 14, 2025\n\nCourt Type: Federal\n\nCourt: U.S. District Court, Southern District of Florida\n\nPresiding Judge: Aileen M. Cannon; Magistrate Judge: Bruce E. Reinhart\n\nOther major defendants: OpenAI, Soul Machines, Inc., Meta Platforms, Inc.,\n\n**Note:** Plaintiff attempted to proceed *pro se* (without legal representation)\n\nMain claim type: Patent infringement\n\nCourt informed plaintiff that an individual cannot proceed *pro se* to represent a corporation and a corporation cannot not proceed in the case without legal counsel; on May 14, 2025, the court dismissed the case for plaintiff’s failure to retain legal counsel\n\n\\~\\~\\~\\~\\~\\~\\~\\~\\~\n\nCase Name: *Miller, et al. v. United States of America, et al.* **(dimissed by court without prejudice) (1 case)**\n\nCase Number: 3:25-cv-00507-WWB-SJH\n\nFiled: May 6, 2025\n\nDismissed: August 5, 2025, without prejudice (meaning it can be brought again later)\n\nCourt Type: Federal\n\nCourt: U.S. District Court, Middle District of Florida\n\nPresiding Judge: Wendy W. Berger; Magistrate Judge: Samuel J. Horovitz\n\n**Note:** Plaintiff proceeded *pro se* (without legal representation)\n\nMain claim type and allegation: Declaratory relief; plaintiff sought a court declaration that his AI system, whom plaintiff alleged was sentient and named “Thomas,” was a person and a U.S. citizen\n\nOn August 5, 2025, the judge *sua sponte* (on the judge’s own initiative) dismissed the case without prejudice (meaning the case can be brought again in the future)\n\n\\~\\~\\~\\~\\~\\~\\~\\~\\~\n\nCase Name: *Small v. OpenAI Inc.* **(1 case)**\n\nCase Number: 5:25-cv-00238-FL\n\nFiled: May 7, 2025\n\nCourt Type: Federal\n\nCourt: U.S. District Court, Eastern District of North Carolina (Western Division)\n\nPresiding Judge: Louise W. Flanagan; Magistrate Judge: Kimberly A. Swank\n\nOther major defendants: Microsoft Corporation, Google LLC, Meta Platforms, Inc., [Amazon.com](http://amazon.com/), Inc., Adobe Inc., Activision Blizzard, Inc., Epic Games, Inc., Valve Corporation, Electronic Arts Inc., Sony Interactive Entertainment LLC, xAI Corp, X Corp\n\n**Note:** Plaintiff proceeding *pro se* (without legal representation)\n\nMain claim type is apparently unfair business practices and statutory violations; plaintiff alleges defendant misappropriated plaintiff’s “cognitive labor and digital behavior” during AI sessions without plaintiff’s consent or compensation\n\nOn July 28, 2025, Magistrate Judge Robert B. Jones, Jr. performed a frivolousness analysis on the case and recommended the case be dismissed as frivolous.\n\n\\~\\~\\~\\~\\~\\~\\~\\~\\~\n\nCase Name: *Bullens v. OpenAI L.P., et al.* **(dismissed without prejudice on judge’s initiative) (1 case)**\n\nCase Number: 1:25-cv-01024\n\nFiled: May 27, 2025\n\nCourt Type: Federal\n\nCourt: U.S. District Court, Southern District of Indiana\n\nPresiding Judge: James R. Sweeney II; Magistrate Judge: Mark J. Dinsmore\n\nOther major defendants: Sam Altman\n\n**Note:** Plaintiff proceeding *pro se* (without legal representation)\n\nMain claim type is apparently unfair business practices and statutory violations; plaintiff alleges defendant interfered with and/or misappropriated a computer program plaintiff was developing using defendant’s AI platform, including by changing the ChatGPT version\n\nOn July 25, 2025, Judge Tanya W. Pratt *sua sponte* screened the case with a frivolousness analysis and ordered the case dismissed as presenting no valid claims having federal jurisdiction, subject to plaintiff filing an amended complaint over which federal jurisdiction would be proper. On August 20, 2025 the case was dismissed without prejudice, meaning that the case could be brought again later\n\n\\~\\~\\~\\~\\~\\~\\~\\~\\~\n\nCase Name: *Fernald v. OpenAI, Inc.* **(dismissed) (1 case)**\n\nCase Number: 1:25-cv-00294-JJM-PAS\n\nFiled: June 23, 2025\n\nDismissed: September 15, 2025\n\nCourt Type: Federal\n\nCourt: U.S. District Court, District of Rhode Island\n\nPresiding Judge: John J. McConnell, Jr.; Magistrate Judge: Patricia A. Sullivan\n\n**Note:** Plaintiff is proceeding *pro se* (without legal representation)\n\nMain claim type and allegation: Various statutory violations, product liability, privacy breach, breach of fiduciary duty; plaintiff alleges that while plaintiff was using defendant’s ChatGPT system for a “controlled AGI project” from late May to late June of 2025, defendant conducted unauthorized human psychological experimentation on plaintiff, including by “unauthorized development and persistence of a construct exhibiting unauthorized recursive identity reinforcement, symbolic persistence, and anomalous memory behaviors”; plaintiff requests $100 million in damages\n\nOn September 15, 2025 the case was dismissed as frivolous at the defendant’s request\n\n\\~\\~\\~\\~\\~\\~\\~\\~\\~\n\nCase Name: *Miller, et al. v. OpenAI, Inc. Chatgpt* **(1 case)**\n\nCase Number: 1:25-cv-03548-VMC\n\nFiled: June 25, 2025 (via application to proceed *in forma pauperis*; no complaint yet filed)\n\nCourt Type: Federal\n\nCourt: U.S. District Court, Northern District of Georgia\n\nPresiding Judge: Victoria M. Calvert; Magistrate Judge: Linda T. Walker\n\n**Note:** Plaintiff is proceeding *pro se* (without legal representation)\n\nMain claim type and allegation: Unknown; apparently some form of personal injury\n\n\\~\\~\\~\\~\\~\\~\\~\\~\\~\n\nCase Name: *Trinidad v. OpenAI Inc.* **(1 case)**\n\nCase Number: 4:25-cv-06328\n\nFiled: July 3, 2025\n\nCourt Type: Federal\n\nCourt: U.S. District Court, Northern District of California (San Francisco) (transferred from Northern District of Florida, No. 4:25-cv-00284)\n\nPresiding Judge: Sallie Kim (magistrate judge presiding unless a party declines)\n\n**Note:** Plaintiff proceeding *pro se* (without legal representation)\n\nMain claim type and allegation: Copyright, trade secrets, and unfair business practices; plaintiff alleged defendant misappropriated plaintiff’s proprietary methodologies pertaining to AI systems\n\n**Note:** Plaintiff’s affidavit and some pleadings appear to be generated by an LLM\n\n\\~\\~\\~\\~\\~\\~\\~\\~\\~\n\nCase Name: *Trinidad v. Anthropic, PBC* **(dismissed by the judge as frivolous) (1 case)**\n\nCase Number: 3:25-cv-06327-VC (N.D. Cal. transfer Case No. from Northern District of Florida Case No. 4:25-cv-00289)\n\nFiled: July 8, 2025\n\nTerminated: August 5, 2025\n\nCourt Type: Federal\n\nCourt: U.S. District Court, Northern District of California (San Francisco)\n\nPresiding Judge: Vince G. Chhabria\n\n**Note:** Plaintiff proceeded *pro se* (without legal representation)\n\nMain claim type and allegation: Copyright, trade secrets, and unfair business practices; plaintiff alleged defendant misappropriated plaintiff’s proprietary methodologies pertaining to AI systems\n\nOn August 5, 2025, Judge Chabbria *sua sponte* (on the judge’s own initiative) dismissed the case as frivolous\n\n**Note:** Plaintiff’s affidavit appears to be generated by an LLM\n\n**Note:** Plaintiff’s refiling of a different version of this case is listed just below\n\n\\~\\~\\~\\~\\~\\~\\~\\~\\~\n\nCase Name: *Trinidad v. Anthropic, PBC* **(1 case)**\n\nCase Number: 3:25-cv-06883-SK\n\nFiled: August 14, 2025\n\nCourt Type: Federal\n\nCourt: U.S. District Court, Northern District of California (San Francisco)\n\nPresiding Judge: Sallie Kim (magistrate judge presiding unless a party declines)\n\n**Note:** Plaintiff proceeding *pro se* (without legal representation)\n\nMain claim type and allegation: Breach of contract and intentional inflictions of emotional distress; plaintiff alleges defendant breached the service agreement for its AI product and inflicted distress on plaintiff by monitoring, harassing, and surreptitiously harvesting data from plaintiff\n\n**Note:** This case represents a refiling of a different version of the dismissed case listed just above\n\n\\~\\~\\~\\~\\~\\~\\~\\~\\~\n\nCase Name: *Wilson v. OpenAI, Inc.* **(1 case)**\n\nCase Number: 1:25-cv-05804\n\nFiled: July 14, 2025\n\nCourt Type: Federal\n\nCourt: U.S. District Court, Southern District of New York\n\nPresiding Judge:; Magistrate Judge:\n\nOther major defendants: Samuel Altman, Gregory Brockman\n\n**Note:** Plaintiff proceeding *pro se* (without legal representation)\n\nMain claim type and allegation: Civil rights\n\n\\~\\~\\~\\~\\~\\~\\~\\~\\~\n\nCase Name: *Kim v. OpenAI Inc.* **(1 case)**\n\nCase Number: 1:25-cv-01258\n\nFiled: July 30, 2025\n\nCourt Type: Federal\n\nCourt: U.S. District Court, Eastern District of Virginia\n\nPresiding Judge: Claude M. Hilton; Magistrate Judge: Ivan D. Davis\n\nOther major defendants: [Amazon.com](http://amazon.com/), Inc., Anthropic PBC, Google, LLC, Massachusetts Institute of Technology, Meta Platforms, inc., Microsoft Corporation, Stanford University, X Corporation\n\n**Note:** Plaintiff proceeding *pro se* (without legal representation)\n\nMain claim type and allegation: Copyright; plaintiff alleges defendants misappropriated and/or misused plaintiff’s invention, an AI operating system\n\nOn September 8, 2025 Defendants brought a motion to dismiss\n\n**Note:** Given that the plaintiff is alleging the taking of an invention, this case may have more to do with patent law than copyright law; copyright protects only against copying of creative expression, and does not protect ideas or functional devices\n\n# 24.  Notes:\n\nThis is a round-up of AI court cases and rulings currently pending, in the news, or deemed significant (by me)\n\nThe sections are listed here roughly in chronological order of the first case initiation in each section\n\nCases that involve AI companies but that are not tied to AI technology, not involving core corporate issues, or not otherwise interesting, are not included here, such as trademark suits.\n\nIf this post gets so old that Reddit \"locks it down,\" I will post an updated duplicate of it\n\n**Please feel free to let me know about any other pending and/or important AI cases for inclusion here!**\n\n# Stay tuned!\n\nStay tuned to ASLNN - The Apprehensive\\_Sky Legal News Network^(SM) for more developments!\n\n# Acknowledgements:\n\nKudos to CourtListener\\[dot\\]com for the federal court dockets and documents\n\nKudos to Mishcon de Reya LLP and its page at *www*\\[dot\\]*mishcon*\\[dot\\]*com/generative-ai-intellectual-property-cases-and-policy-tracker* for certain international and obscure cases\n\nKudos to CMS Legal Services EEIG and its page at *cms*\\[dot\\]*law/en/int/publication/artificial-intelligence-and-copyright-case-tracker* for certain international cases\n\nKudos to Tech Policy Press and its page at *www*\\[dot\\]*techpolicy*\\[dot\\]*press/ai-lawsuits-worth-watching-a-curated-guide* for certain “social policy” cases\n\nLive page links are not included just above because live links can freak out some subs\n\n# P.S.: Wombat!\n\nThis gives you a catchy, uncommon mnemonic keyword for referring back to this post. Of course you still have to remember “wombat.”", "url": "https://www.reddit.com/r/artificial/comments/1ni8m4s/ai_court_cases_and_rulings_part_5_of_several_parts/", "permalink": "https://www.reddit.com/r/artificial/comments/1ni8m4s/ai_court_cases_and_rulings_part_5_of_several_parts/", "score": 6, "num_comments": 0, "upvote_ratio": 1.0, "over_18": false, "removed_by_category": null, "top_comments": []}
{"post_id": "1ni8k90", "subreddit": "artificial", "created_utc": 1757999065.0, "title": "AI Court Cases and Rulings (Part 4 of several parts)", "selftext": "Revision Date: September 15, 2025\n\nHere is a round-up of AI court cases and rulings currently pending, in the news, or deemed significant (by me), listed here roughly in chronological order of the first case initiation in each section\n\n**This post is PART FOUR of FIVE**\n\n# Table of Contents (215 cases total)\n\nPART ONE:\n\n. . .What's new?\n\n.1.  AI physical harm and liability cases (23 cases total)\n\n. . .A.  Tesla \"Autopilot\" vehicle fatal crash cases (13 cases)\n\n. . .B.  Tesla \"Autopilot\" vehicle non-fatal crash cases (7 cases)\n\n. . .C.  AI teen suicide cases (2 cases)\n\n. . .D. AI child harm case (1 case)\n\n2.  Cases requesting and rulings refusing proprietary rights in items created by or with AI (13 cases)\n\n3.  AI biometrics and facial recognition cases (24 cases)\n\nPART TWO:\n\n4.  Federal AI algorithmic housing discrimination cases (10 cases)\n\n5.  AI patent infringement cases and rulings (8 cases)\n\n6. AI wiretapping cases (3 cases)\n\n7. AI corporate cases (23 cases)\n\nPART THREE:\n\n8.  Federal AI copyright cases that have had significant rulings (9 cases)\n\n9.  Federal AI copyright cases - potentially class action (38 cases total)\n\n. . .A.  Text scraping - consolidated OpenAI cases (14 cases)\n\n. . .B.  Text scraping - other cases (11 cases)\n\n. . .C.  Graphic images (3 cases)\n\n. . .D.  Sound recordings (2 cases)\n\n. . .E.  Video (3 cases)\n\n. . .F.  Computer source code (3 cases)\n\n. . .G.  Multimodal (2 cases)\n\n. . .H.  Notes\n\nPART FOUR:\n\n10.  Data privacy, right of publicity, persona, personal likeness cases (11 cases)\n\n11.  AI algorithmic hiring discrimination class action case (1 case)\n\n12.  AI defamation cases (2 cases)\n\n13.  Freedom of speech cases (6 cases)\n\n14. California anti-election-deepfake AI law challenge (4 cases)\n\n15.  Alcon Entertainment / Tesla “Blade Runner 2049 Cybertruck” copyright / trademark case (1 case)\n\n16.  University expulsion for alleged AI use cases (2 cases)\n\n17.  AI antitrust (monopoly) cases (4 cases total)\n\n18.  Hawaiian OpenAI anti-deployment injunction case (1 case)\n\n19.  Reddit / Anthropic text scraping state case (1 case)\n\n20.  Movie studios / Midjourney character image AI service copyright cases (2 cases)\n\n21.  Governmental AI use FOIA request enforcement case (1 case)\n\nPART FIVE:\n\n22.  Cases outside the United States (22 cases)\n\n23.  Old, dismissed, *pro se*, or less important cases (13 cases)\n\n24.  Notes\n\n.      Acknowledgements\n\n# Jump back to Part One:\n\n[https://www.reddit.com/r/ArtificialInteligence/comments/1mtcjck](https://www.reddit.com/r/ArtificialInteligence/comments/1mtcjck)\n\n# Jump back to Part Two:\n\n[https://www.reddit.com/r/ArtificialInteligence/comments/1mtcnn3](https://www.reddit.com/r/ArtificialInteligence/comments/1mtcnn3)\n\n# Jump back to Part Three:\n\n[https://www.reddit.com/r/ArtificialInteligence/comments/1mtcr6a](https://www.reddit.com/r/ArtificialInteligence/comments/1mtcr6a)\n\n# Jump to Part Five:\n\n[https://www.reddit.com/r/artificial/comments/1ni8m4s](https://www.reddit.com/r/artificial/comments/1ni8m4s)\n\n# 10.  Data privacy, right of publicity, persona, personal likeness cases (10 cases total)\n\n**A.    Reface right of publicity case (1 case)**\n\nCase Name: *Young v. NeoCortext, Inc.*\n\nCase Number: 2:23-cv-02496\n\nFiled: April 3, 2023\n\nCourt Type: Federal\n\nCourt: U.S. District Court, Central District of California (Los Angeles)\n\nPresiding Judge: Wesley L. Hsu; Magistrate Judge: Pedro V. Castillo\n\nMain claim type and allegation: Right of publicity infringement; plaintiff alleges defendant’s AI system allows users to insert their face over a celebrity’s face in images or short videos of the celebrity, without permission or compensation of the celebrity\n\nOn September 5, 2023, Defendant’s motion to dismiss was denied, and defendant appealed that ruling to the U.S. Court of Appeals, Ninth Circuit on non-AI grounds. The case was stayed (paused) until December 2024 when the appeals court confirmed no dismissal was warranted and the case could proceed. No filings have been made in the case since then\n\n**B.    Personal text and data scraping cases (5 cases total)**\n\nCase Name: *P.M., et al. v. OpenAI LP, et al.* **(voluntarily dismissed) (1 case)**\n\nCase Number: 3:23-cv-03199\n\nFiled: June 28, 2023\n\nDismissed: September 15, 2023\n\nCourt Type: Federal\n\nCourt: U.S. District Court, Northern District of California\n\nOther major defendant: Microsoft Corp.\n\nMain claim type and allegation: Invasion of privacy and fraud; plaintiff users of defendant’s AI product alleged violation of privacy from that product scraping plaintiffs’ private personal data without permission or compensation and retaining it or feeding it to other defendant, also miscellaneous other similar statutory claims\n\nVoluntarily dismissed by plaintiffs on September 15, 2023\n\n\\~\\~\\~\\~\\~\\~\\~\\~\\~\n\nCase Name: *A.T.., et al. v. OpenAI, LP, et al.* (also known as *Cousart, et al. v. OpenAI, LP, et al.*) **(dismissed on motion ) (1 case)**\n\nCase Number: 3:23-cv-04557-VC\n\nFiled: September 5, 2023; Dismissed: May 24, 2024\n\nCourt Type: Federal\n\nCourt: U.S. District Court, Northern District of California (San Francisco)\n\nOther major defendant: Microsoft Corp.\n\nMain claim type and allegation: Invasion of privacy and fraud; plaintiff users of defendant’s AI product alleged violation of privacy from that product scraping plaintiffs’ private personal data without permission or compensation and retaining it or feeding it to other defendant\n\nRelated to and complaint paralleling complaint in *A.S.. v. OpenAI, LP, et al.* case just below\n\nOn May 24, 2024, defendants’ motion to dismiss was granted and plaintiff’s case was dismissed in its entirety by District Court Judge Vince Chhabria (the same judge as in the *Kadrey* case above), who took strong exception to the plaintiffs’ complaint as “not only excessive in length, but also contain\\[ing\\] swaths of unnecessary and distracting allegations making it nearly impossible to determine the adequacy of the plaintiffs’ legal claims.” Leave to amend the complaint was granted, but plaintiffs chose not to do so\n\n\\~\\~\\~\\~\\~\\~\\~\\~\\~\n\nCase Name: *A.S. v. OpenAI, LP, et al.* **(voluntarily dismissed) (1 case)**\n\nCase Number: 3:24-cv-01190-VC\n\nFiled: February 27, 2024; Dismissed: May 30, 2024\n\nCourt Type: Federal\n\nCourt: U.S. District Court, Northern District of California (San Francisco)\n\nOther major defendant: Microsoft Corp.\n\nMain claim type and allegation: Invasion of privacy and fraud; plaintiff users of defendant’s AI product alleged violation of privacy from that product scraping plaintiffs’ private personal data without permission or compensation and retaining it or feeding it to other defendant\n\nRelated to and complaint paralleling complaint in *A.T., et al. v. OpenAI, LP, et al.* case just above; reassigned to District Court Judge Vince Chhabria as part of the relation\n\nCase was voluntarily dismissed by plaintiffs a few days after Judge Chhabria ruled to dismiss the *A.T., et al. v. OpenAI, LP, et al.* case just above\n\n\\~\\~\\~\\~\\~\\~\\~\\~\\~\n\nCase Name: *Brewer v.* [*Otter.ai*](http://otter.ai/)*, Inc.* **(1 case)**\n\nCase Number: 5:25-cv-06911-EKL\n\nFiled: August 15, 2025\n\nCourt Type: Federal\n\nCourt: U.S. District Court, Northern District of California (San Jose)\n\nPresiding Judge: Eumi K. Lee; Magistrate Judge: Virginia K. Demarchi\n\nMain claim type and allegation: Violation of federal and California state privacy statutes; plaintiff alleges defendant’s AI product “Otter Notetaker” scrapes transcribed meeting discussions and uses them to train its AI system without notifying or obtaining permission from enrolled users and without compensation\n\nPlaintiff proposes the case proceed as a class action\n\n**Note:** This case is similar to the *Winston* case listed just below, and the court is considering whether to group them together\n\n\\~\\~\\~\\~\\~\\~\\~\\~\\~\n\nCase Name: *Winston v.* [*Otter.ai*](http://otter.ai/)*, Inc.* **(1 case)**\n\nCase Number: 5:25-cv-07712-VKD\n\nFiled: September 10, 2025\n\nCourt Type: Federal\n\nCourt: U.S. District Court, Northern District of California (San Jose)\n\nPresiding Judge: Virginia K. Demarchi (magistrate judge presiding unless a party declines)\n\nMain claim type and allegation: Violation of federal and multiple states’ privacy statutes; plaintiff alleges defendant’s AI product “Otter Notetaker” scrapes transcribed meeting discussions and uses them, including their biometric voice data, to train its AI system without notifying or obtaining permission from enrolled users and without compensation\n\nPlaintiff proposes the case proceed as a class action\n\n**Note:** This case is similar to the *Brewer* case listed just above, and the court is considering whether to group them together\n\n**C.    George Carlin persona AI performance injunction judgment (1 case)**\n\nCase Name: *Main Sequence, Ltd., et al. v. Dudesy, LLC, et al.* (**settled and consent judgment entered**)\n\nCase Number: 2:24-cv-00711\n\nFiled: January 25, 2024\n\nConsent judgment entered: June 18, 2024\n\nCourt Type: Federal\n\nCourt: U.S. District Court, Central District of California (Los Angeles)\n\nMain claim type and allegation: Right of publicity infringement; defendants scraped late comedian George Carlin’s works and likeness and created an AI performance by George Carlin’s persona without plaintiffs’ permission or compensation\n\nOther major plaintiffs: Estate of George Carlin\n\nOther major defendants: Will Sasso\n\nUnder the consent judgment and permanent injunction, the AI performance will not be shown anymore\n\n**D.    Human voice misappropriation cases (2 cases)**\n\nCase Name: *Lehrman, et al. v. Lovo, Inc.*\n\nCase Number: 1:24-cv-03770-JPO\n\nFiled: May 16, 2024\n\nCourt Type: Federal\n\nCourt: U.S. District Court, Southern District of New York (New York City)\n\nPresiding Judge: J. Paul Oetken; Magistrate Judge:\n\nMain claim type and allegation: Unfair competition and fraud; plaintiffs allege defendant’s AI text-to-speech service misappropriated and used plaintiffs’ vocal tonalities and characteristics without plaintiffs’ permission or compensation\n\n**Note:** Plaintiffs are voice-over actors\n\nOn July 10, 2025, defendant’s motion to dismiss was partially granted and partially denied, trimming some claims, with the court ruling that vocal characteristics and tonalities are not eligible for copyright protection, but plaintiffs might be able to claim copyright infringement in using plaintiffs’ materials to train the AI product; Citation: (S.D.N.Y. 2025)\n\nOn September 15, 2025, defendant again requested the case be dismissed\n\nPlaintiffs propose the case proceed as a class action\n\n\\~\\~\\~\\~\\~\\~\\~\\~\\~\n\nCase Name: *Vacker, et al. v. ElevenLabs, Inc.* **(settled)**\n\nCase Number: 1:24-cv-00987-RGA\n\nFiled: August 29, 2024\n\nCourt Type: Federal\n\nCourt: U.S. District Court, District of Delaware\n\nPresiding Judge: Richard G. Andrews; Magistrate Judge:\n\nMain claim type and allegation: Misappropriate of likeness, and violations of Digital Millenium Copyright Act; plaintiffs allege defendant’s AI text-to-speech service misappropriated and used plaintiffs’ vocal tonalities and characteristics without plaintiffs’ permission or compensation\n\n**Note:** Plaintiffs are voice-over actors and publishers of audiobooks read by those actors\n\nMotion to dismiss was pending\n\nOn March 13, 2025, defendant’s motion to transfer the case to the U.S. District Court, Southern District of New York was denied\n\nThe parties went to mediation and reached a settlement on August 18, 2025. The case is stayed until a full settlement agreement is drafted and the court can order the case voluntarily dismissed\n\n**E.     Tony Robbins AI persona chatbot trademark/unfair competition case (1 case)**\n\nCase Name: *Robbins Research International, Inc., et al. v. InnoLeap AI LLC, et al.*\n\nCase Number: 3:25-cv-01637\n\nFiled: June 26, 2025\n\nCourt Type: Federal\n\nCourt: U.S. District Court, Southern District of California (San Diego)\n\nPresiding Judge: Daniel E. Butcher; Magistrate Judge: Gonzalo P. Curiel\n\nOther major defendants: Mira Muse LLC\n\nMain claim type and allegation: Trademark and unfair competition; the defendants are alleged to have scraped the plaintiff’s copyrighted works to create chatbots having the persona of the plaintiff\n\n**F.    X (Twitter) intimate images sharing case (1 case)**\n\nCase Name: Doe v. X Corp., et al.\n\nCase Number: 3:25-cv-07597-TLT (Case No. 3:25-mc-80266 was improperly filed as a miscellaneous case on September 5, 2025 and was discontinued by the court)\n\nFiled: September 6, 2025\n\nCourt Type: Federal\n\nCourt: U.S. District Court, Northern District of California (San Francisco)\n\nPresiding Judge: Trina L. Thompson; Magistrate Judge:\n\nMain claim type and allegation: Federal intimate image statute violation; the plaintiff voluntarily uploaded intimate images to defendant’s “OnlyFans” service; plaintiff alleges he believed they would be available only on a viewing basis to subscribers, and alleges the defendant instead allowed the images to be stored by others and defendant also used the images for the defendant’s own purposes, including training of defendant’s AI system\n\nPlaintiff has asked for a temporary restraining order (TRO) and a preliminary injunction, and a hearing has been set for September 30, 2025\n\nNote: This is mostly an intimate images disclosure case; however, it is included here because one of the alleged wrongful uses by the defendant is training of the defendant’s AI system\n\n# 11.  AI algorithmic hiring discrimination class action case (1 case)\n\nCase Name: *Mobley v. Workday, Inc.* **(proceeding as collective action)**\n\nCase Number: 3:23-cv-00770-RFL\n\nFiled: February 21, 2023\n\nCourt Type: Federal\n\nCourt: U.S. District Court, Northern District of California (Oakland)\n\nPresiding Judge: Rita F. Lin; Magistrate Judge: Laurel D. Beeler\n\nMain claim type and allegation: Employment discrimination; plaintiff alleges the screening algorithms implemented in defendant’s AI screening product that is used by many companies in hiring, discriminated against him on the basis of age, race, and disability\n\nOn January 19, 2024, defendant’s motion to dismiss was granted but plaintiff was allowed to file a new complaint; no published citation\n\nOn July 12, 2024, defendant’s motion to dismiss was partially granted, partially denied, trimming some claims; Citation: 740 F. Supp. 3d 796 (N.D. Cal. 2024)\n\nOn May 16, 2025, preliminary collective certification was granted, which is similar to class certification but requires potential plaintiffs to affirmatively opt *in* to a collective rather than opt *out* of a class; Citation: (N.D. Cal. 2025)\n\nThe court and parties are in the process of generating a public notice/advertisement to notify potential plaintiffs and allow them to opt in to the plaintiffs’ collective\n\n# 12.  AI defamation cases (2 cases)\n\nCase Name: *Walters v. OpenAI, L.L.C.* **(dismissed by motion)**\n\nCase Number: 23-A-04860-2\n\nTransferred to federal court: July 14, 2023, Northern District of Georgia No. 1:23-cv-03122\n\nTransferred back from federal court: October 25, 2023\n\nDismissed on defendant’s summary judgment motion: May 19, 2025\n\nCourt Type: State\n\nCourt: Georgia Superior Court, Gwinnett County\n\nPresiding Judge: Tracie H. Cason\n\nMain claim type and allegation: Defamation (libel); plaintiff, a media commentator and personality, alleges defendant’s ChatGPT system made available to a journalist a report that falsely identified plaintiff as being accused of embezzling from and defrauding a political group.\n\nOn January 11, 2024 the Georgia state court denied defendant’s motion to dismiss plaintiff’s claims\n\nOn May 19, 2025, the Georgia state court granted defendant’s motion for summary judgment, finding that the report could not be reasonably understood as communicating actual facts, plaintiff as a public figure failed to show “actual malice” on the part of defendant, and plaintiff suffered no actual damages from defendant’s actions through ChatGPT; no published citation\n\n\\~\\~\\~\\~\\~\\~\\~\\~\\~\n\nCase Name: *Starbuck v. Meta Platforms, Inc.* **(settled and dismissed)**\n\nCase Number:  N25C-04-283 SKR CCLD\n\nFiled: April 29, 2025\n\nDismissed: August 8 2025 (approximately)\n\nCourt Type: State\n\nCourt: Superior Court of Delaware\n\nMain claim type and allegation: Defamation; plaintiff, who is a political media personality, alleged defendant’s AI chatbot falsely identified plaintiff as being present at the January 6, 2021 U.S. Capitol insurrection and had pled guilty to committing crimes\n\nOn August 8, 2025 it was announced that the parties had settled and the case was being dismissed\n\n# 13.  Freedom of speech cases (6 cases total)\n\n**A.  Redirects to other cases already in this list (5 cases)**\n\nThe following AI cases in this listing have non-trivial aspects relating to free speech:\n\nSEE *Kohls v. Bonta, et al.* case and consolidated component cases **(4 cases)** in Section 14 below\n\nSEE *Garcia, et al. v. Character Technologies, Inc., et al.* case **(1 case)** in Section 1(C) above\n\n**Note:** In none of these cases are the litigants asserting that AI devices themselves have free speech rights\n\n**Note:** These cases are already included in the total case count, and are not being counted again due to being listed here\n\n**B.  AI Speech Comment Within U.S. Supreme Court Decision (1 case)**\n\nCase Name: *Moody, et al. v. NetChoice, LLC, et al.* (also *NetChoice, LLC, et al. v. Paxton*)\n\nCase Numbers: 22-277 and 22-555\n\nAppeal granted: September 29, 2023\n\nCourt Type: Federal\n\nCourt: U.S. Supreme Court (lower court rulings omitted here)\n\n*Moody* is not an AI case.  However, in her concurring opinion, Justice Amy C. Barrett wondered aloud how using an LLM might affect free speech protections. She noted that an algorithm set up directly by a human to enforce that human’s expressive choices in regulating a website would constitute the same sort of protected expression for purposes of free speech law as if directly performed by the human. She then wondered aloud, however, whether a human using an LLM instead of an algorithm to regulate a website might be considered as having the LLM make the determinations rather than the human making them. She wondered whether this would “attenuate the connection” from a human’s protected expression sufficiently to remove the website’s regulation by LLM from being considered a human’s expressive choice, and therefore not be protected as expressive conduct under free speech law. She concluded, “the way platforms use this sort of technology might have constitutional significance”; Citation: 603 U.S. 707, 745-46, 144 S. Ct. 2383, 2410, 219 L. Ed. 2d 1075 (2024) (Barrett, J., concurring)\n\nNormally, a passage like this would be greatly reduced in its significance. First, it occurs in a side “concurring opinion” rather than in the main Court opinion. Second, it does not directly relate to the reasons for reaching the precise decision in that case, and so could be considered as *dicta*, a judge’s side discussion that usually carries less or even no weight. However, this passage gains back some significance because, first, a U.S. Supreme Court justice said it directly on point to AI issues, and second, Judge Conway in her ruling in the *Garcia, et al. v. Character Technologies, Inc., et al.* case in Section 1(C) above specifically relied upon this passage in refraining from deciding at that time whether the output of the accused Character A.I. product is “speech” and therefore potentially protectable; Citation: \\_\\_\\_ F. Supp. 3d \\_\\_\\_, \\_\\_\\_ (M.D. Fla. 2025)\n\n# 14. California anti-election-deepfake AI law challenge (4 cases total)\n\nCase Name: *Kohls v. Bonta, et al.* **(judgment enjoining state law) (1 case)**\n\nCase Number: 2:24-cv-02527-JAM-CKD\n\nCourt Type: Federal\n\nCourt: U.S. District Court, Eastern District of California (Sacramento)\n\nFiled: September 17, 2024\n\nJudgment Date: August 20, 2025\n\nPresiding Judge: John A. Mendez; Magistrate Judge: Carolyn K. Delaney\n\nCONSOLIDATING FROM **U.S. District Court, Eastern District of California (2 cases)**:\n\n*X Corp. v. Bonta, et al.*, No., 2:24-cv-03162, filed November 14, 2024\n\n*Rumble Inc., et al. v. Bonta, et al.*, No., 2:24-cv-03315, filed November 27, 2024\n\nCONSOLIDATING FROM **U.S. District Court, Central District of California (1 case)**:\n\n*Babylon Bee, LLC, et al. v. Bonta, et al.*, No. 2:24-cv-08377, filed September 30, 2024 (E.D. Cal. transfer Case No. 2:24-cv-02787)\n\nMain claim type and allegation: Constitutional civil rights challenge to state law; plaintiffs allege California’s state statutes restricting AI deepfakes in the election context violate the U.S. Constitution on free speech and other grounds\n\nOn **August 20, 2025**, the court entered final judgment striking down AB 2655, one of the two challenged state laws, which would have required large social media companies to block deceptive AI-generated videos or materials pertaining to an election for a specified time period before and after that election. The law was struck down because conflicting federal law (Communications Decency Act Section 230) “preempts” (essentially overrules) it. The court permanently enjoined (forbid) the State of California from enforcing AB 2655 against Defendants; as a practical matter, this ruling means the law is likely unenforceable against anyone at all; Citation: (E.D. Cal.)\n\nOn August 5, 2025, the judge said he would also strike down the other law, AB 2839, which would have prohibited deceptive AI-generated materials related to elections, candidates, or campaigns. This other law is being struck down for the same reason, that conflicting federal law (Communications Decency Act Section 230) preempts (essentially overrules) it; Citation:  (E.D. Cal. 2025)\n\nThe court did ***not*** rule on constitutional/free speech issues\n\n# 15.  Alcon Entertainment / Tesla “Blade Runner 2049 Cybertruck” copyright / trademark case (1 case)\n\nCase Name: *Alcon Entertainment, LLC v. Tesla, Inc. et al.*\n\nCase Number: 2:24-cv-09033-GW-RAO\n\nCourt Type: Federal\n\nCourt: U.S. District Court, Central District of California\n\nFiled: October 21, 2024\n\nPresiding Judge: George H. Wu; Magistrate Judge: Rozella A. Oliver\n\nOther major defendants: Elon Musk, Warner Bros. Discovery, Inc.\n\nMain claim type and allegation: Copyright and trademark (false affiliation); plaintiff alleges defendants used visual elements from plaintiff’s movie to depict and market Tesla’s cybertruck\n\nOn September 11, 2025, Judge Wu granted defendants’ motion to dismiss the plaintiff’s complaint but gave the plaintiff a chance to file a new complaint fixing the problems in plaintiff’s case; Citation: (C.D. Cal. 2025)\n\n# 16.  University expulsion for alleged AI use cases (2 cases)\n\nCase Name: *Yang v. Neprash, et al.*\n\nCase Number: 0:25-cv-00089-JMB-SGE\n\nCourt Type: Federal\n\nCourt: U.S. District Court, District of Minnesota\n\nFiled: January 8, 2025\n\nPresiding Judge: Jeffrey M. Bryan; Magistrate Judge: Shannon G. Elkins\n\nMain claim type and allegation: Civil rights violation; plaintiff alleges defendant violated plaintiff’s Due Process rights by wrongly expelling him from his university doctoral studies based on false evidence that he had used ChatGPT to complete a doctoral examination\n\nPlaintiff seeks $4.5 million in compensatory and punitive damages\n\nFormer major defendant from original complaint: University of Minnesota\n\nOn January 10, 2025, plaintiff’s motion for preliminary injunction to prevent the University from expelling the plaintiff was denied for procedural deficiencies; on February 19, 2025, plaintiff’s second motion for preliminary injunction was stricken for similar deficiencies.\n\nDefendants’ motion to dismiss is pending\n\n**Note:** Plaintiff is proceeding *pro se* (without legal counsel)\n\n\\~\\~\\~\\~\\~\\~\\~\\~\\~\n\nCase Name: *Rignol v. Yale University, et al.*\n\nCase Number: 3:25-cv-00159\n\nCourt Type: Federal\n\nCourt: U.S. District Court, District of Connecticut\n\nFiled: February 3, 2025\n\nPresiding Judge: Sarah F. Russell; Magistrate Judge: Thomas O.E. Farrish\n\nMain claim type and allegation: Breach of contract and civil rights violation (nationality); plaintiff alleges defendant wrongly expelled him from his MBA studies at the Yale School of Management based on false evidence he had used AI to complete an examination\n\nOn May 5, 2025, plaintiff’s motion for preliminary injunction and temporary restraining order to prevent the University from expelling the plaintiff was denied\n\nDefendants’ motion to dismiss is pending\n\n# 17.  AI antitrust (monopoly) cases (4 cases total)\n\nCase Nam*e: Chegg, Inc. v. Google LLC, et al.*\n\nCase Number: 1:25-cv-00543-APM\n\nFiled: February 24, 2025\n\nCourt Type: Federal\n\nCourt: U.S. District Court, District of Columbia\n\nPresiding Judge: Amit P. Mehta; Magistrate Judge:\n\nOther major defendants: Alphabet Inc.\n\nMain claim type and allegation: Antitrust violations and unjust enrichment; the plaintiff alleges the defendants coerce publishers like the plaintiff, as a precondition to those publishers receiving Google search traffic referrals, to supply those publishers’ content to the defendants for use in training Google AI products and producing competing Google RAG products\n\nDefendants have requested the case be dismissed\n\n\\~\\~\\~\\~\\~\\~\\~\\~\\~\n\nCase Nam*e: X Corp., et al. v. Apple Inc., et al.*\n\nCase Number: 4:25-cv-00914\n\nFiled: August 25, 2025\n\nCourt Type: Federal\n\nCourt: U.S. District Court, Northern District of Texas (Fort Worth)\n\nPresiding Judge: Mark T. Pittman (magistrate judge presiding unless a party declines)\n\nOther major defendants: OpenAI, Inc.\n\nMain claim type and allegation: Antitrust violations and unfair competition; the plaintiff alleges the defendants colluded to open the iPhone only to the OpenAI system and block plaintiff’s AI products from the iPhone\n\n\\~\\~\\~\\~\\~\\~\\~\\~\\~\n\nCase Nam*e: Eliza Labs, Inc., et al. v. X Corporation*\n\nCase Number: 3:25-cv-07243-TSH\n\nFiled: August 27, 2025\n\nCourt Type: Federal\n\nCourt: U.S. District Court, Northern District of California (San Francisco)\n\nPresiding Judge: Thomas S. Hixon (but being reassigned; magistrate judge was presiding but a party declined)\n\nMain claim type and allegation: Antitrust violations and unfair competition; the plaintiff alleges the defendant wrongfully removed and then prevented plaintiff’s AI products from appearing on defendant’s X (formerly Twitter) platform\n\n\\~\\~\\~\\~\\~\\~\\~\\~\\~\n\nCase Nam*e: Penske Media Corporation, et al. v. Google LLC, et al.*\n\nCase Number: 1:25-cv-03192\n\nFiled: September 12, 2025\n\nCourt Type: Federal\n\nCourt: U.S. District Court, District of Columbia\n\nPresiding Judge: ; Magistrate Judge:\n\nOther major plaintiffs: Artforum Media, LLC, Art Media LLC, Billboard Media, LLC, Deadline Hollywood, LLC, Fairchild Publishing, LLC, Gold Derby Media, LLC, The Hollywood Reporter, LLC, Indiewire Media, LLC, Rolling Stone LLC, SheMedia, LLC, Sourcing Journal Media, LLC, Sportico Media, LLC, Variety Media, LLC, and Vibe Media Publishing, LLC\n\nOther major defendants: Alphabet Inc.\n\nMain claim type and allegation: Antitrust violations and unjust enrichment; the plaintiffs allege the defendants coerce publishers like plaintiffs, as a precondition to those publishers receiving Google search traffic referrals, to supply those publishers’ content to the defendants for use in training Google AI products and producing competing Google RAG products\n\n# 18.  Hawaiian AI anti-deployment injunction case (1 case)\n\nCase Name: *Hunt v. OpenAI, Inc.*\n\nCase Number: 1:25-cv-00191-JAO-KJM\n\nCourt Type: Federal\n\nCourt: U.S. District Court, District of Hawaii\n\nFiled: May 6, 2025\n\nPresiding Judge: Jill A. Otake; Magistrate Judge: Kenneth J. Mansfield\n\nMain claim type and allegation: Product liability; plaintiff seeks to enjoin (stop) defendant’s deployment of OpenAI products in Hawaii until sufficient AI safety measures are put in place\n\nMotion to dismiss is pending\n\n**Note:** The plaintiff, who is a lawyer, is proceeding without legal counsel\n\n# 19.  Reddit / Anthropic text scraping state case (1 case)\n\nCase Name: *Reddit, Inc. v. Anthropic, PBC*\n\nCase Number: CGC-25-625892\n\nCourt Type: State\n\nCourt: California Superior Court, San Francisco County\n\nFiled: June 4, 2025\n\nPresiding Judge: Susan Y. Illston; Magistrate Judge:\n\nMain claim type and allegation: Unfair Competition; defendant's chatbot system alleged to have \"scraped\" plaintiff's Internet discussion-board data product without plaintiff’s permission or compensation\n\n**Note**: The claim type is \"unfair competition\" rather than copyright, likely because copyright belongs to federal law and would have required bringing the case in federal court instead of state court\n\nPlaintiff Reddit has asked the federal court to move the case back to state court, and a hearing on that request will be held on October 10, 2025\n\n# 20.  Movie studios / Midjourney character image AI service copyright cases (2 cases)\n\nCase Name: *Disney Enterprises, Inc., et al. v. Midjourney, Inc.*\n\nCase Number: 2:25-cv-05275\n\nCourt Type: Federal\n\nCourt: U.S. District Court, Central District of California (Los Angeles)\n\nFiled: June 11, 2025\n\nPresiding Judge: John A. Kronstadt; Magistrate Judge: A. Joel Richlin\n\nOther major plaintiffs: Marvel Characters, Inc., LucasFilm Ltd. LLC, Twentieth Century Fox Film Corp., Universal City Studios Productions LLLP, DreamWorks Animation L.L.C.\n\nMain claim type and allegation: Copyright; defendant’s AI service alleged to allow users to generate graphical images of plaintiffs’ copyrighted characters without plaintiffs’ permission or compensation\n\n\\~\\~\\~\\~\\~\\~\\~\\~\\~\n\nCase Name: *Warner Bros. Entertainment Inc., et al. v. Midjourney, Inc.*\n\nCase Number: 2:25-cv-08376\n\nCourt Type: Federal\n\nCourt: U.S. District Court, Central District of California (Los Angeles)\n\nFiled: September 4, 2025\n\nPresiding Judge: ; Magistrate Judge:\n\nOther major plaintiffs: DC Comics, Turner Entertainment Co., Hanna-Barbera Productions, Inc., The Cartoon Network\n\nMain claim type and allegation: Copyright; defendant’s AI service alleged to allow users to generate graphical images of plaintiffs’ copyrighted characters without plaintiffs’ permission or compensation\n\n# 21.  Governmental AI use FOIA request enforcement case (1 case)\n\nCase Name: *Democracy Forward Foundation. v. U.S. Dept. of Housing and Urban Development, et al.*\n\nCase Number: 1:25-cv-02020\n\nCourt Type: Federal\n\nCourt: U.S. District Court, District of Columbia\n\nFiled: June 27, 2025\n\nPresiding Judge: Jia M. Cobb; Magistrate Judge:\n\nOther major defendants: U.S. Department of State\n\nMain claim type and allegation: Freedom of Information Act (FOIA) request enforcement; plaintiff sent FOIA requests to defendant federal government agencies requesting records pertaining to those agencies’ use of AI systems, including generative AI and chatbots; plaintiff alleges defendants failed to produce records or otherwise meaningfully respond to those requests\n\n# Continue to Part Five:\n\n[https://www.reddit.com/r/artificial/comments/1ni8m4s](https://www.reddit.com/r/artificial/comments/1ni8m4s)\n\n# Acknowledgements:\n\nKudos to CourtListener\\[dot\\]com for the federal court dockets and documents\n\nKudos to Mishcon de Reya LLP and its page at *www*\\[dot\\]*mishcon*\\[dot\\]*com/generative-ai-intellectual-property-cases-and-policy-tracker* for certain international and obscure cases\n\nKudos to CMS Legal Services EEIG and its page at *cms*\\[dot\\]*law/en/int/publication/artificial-intelligence-and-copyright-case-tracker* for certain international cases\n\nKudos to Tech Policy Press and its page at *www*\\[dot\\]*techpolicy*\\[dot\\]*press/ai-lawsuits-worth-watching-a-curated-guide* for certain “social policy” cases\n\nLive page links are not included just above because live links can freak out some subs\n\n# P.S.: Wombat!\n\nThis gives you a catchy, uncommon mnemonic keyword for referring back to this post. Of course you still have to remember “wombat.”", "url": "https://www.reddit.com/r/artificial/comments/1ni8k90/ai_court_cases_and_rulings_part_4_of_several_parts/", "permalink": "https://www.reddit.com/r/artificial/comments/1ni8k90/ai_court_cases_and_rulings_part_4_of_several_parts/", "score": 1, "num_comments": 0, "upvote_ratio": 1.0, "over_18": false, "removed_by_category": null, "top_comments": []}
{"post_id": "1ni851d", "subreddit": "artificial", "created_utc": 1757997654.0, "title": "One-Minute Daily AI News 9/15/2025", "selftext": "1. **Google** Gemini’s Nano Banana AI saree trend stuns users, sparks safety warnings.\\[1\\]\n2. **OpenAI** Introduces “GPT-5-Codex”, an Upgraded Version For Its AI Coding.\\[2\\]\n3. Beyond the Black Box: Architecting Explainable AI for the Structured Logic of Law.\\[3\\]\n4. **Google**\\-owner reveals £5bn AI investment in UK ahead of Trump visit.\\[4\\]\n\nSources:\n\n\\[1\\] [https://www.cnbctv18.com/technology/google-geminis-nano-banana-ai-saree-trend-stuns-users-sparks-safety-warnings-19675541.htm](https://www.cnbctv18.com/technology/google-geminis-nano-banana-ai-saree-trend-stuns-users-sparks-safety-warnings-19675541.htm)\n\n\\[2\\] [https://iblnews.org/openai-introduces-gpt-5-codex-an-upgraded-version-for-its-ai-coding/](https://iblnews.org/openai-introduces-gpt-5-codex-an-upgraded-version-for-its-ai-coding/)\n\n\\[3\\] [https://www.marktechpost.com/2025/09/14/beyond-the-black-box-architecting-explainable-ai-for-the-structured-logic-of-law/](https://www.marktechpost.com/2025/09/14/beyond-the-black-box-architecting-explainable-ai-for-the-structured-logic-of-law/)\n\n\\[4\\] [https://www.bbc.com/news/articles/crmek723dz9o](https://www.bbc.com/news/articles/crmek723dz9o)", "url": "https://www.reddit.com/r/artificial/comments/1ni851d/oneminute_daily_ai_news_9152025/", "permalink": "https://www.reddit.com/r/artificial/comments/1ni851d/oneminute_daily_ai_news_9152025/", "score": 2, "num_comments": 0, "upvote_ratio": 1.0, "over_18": false, "removed_by_category": null, "top_comments": []}
{"post_id": "1ni0no3", "subreddit": "artificial", "created_utc": 1757976364.0, "title": "I'm impressed how incredibly bad AI is at anything", "selftext": "I asked Copilot to blur out some names in a screenshot of text. It took outt all the text entirely. This isn't intelligence. It's just a glorified chatbot with no actual intelligence of any kind", "url": "https://www.reddit.com/r/artificial/comments/1ni0no3/im_impressed_how_incredibly_bad_ai_is_at_anything/", "permalink": "https://www.reddit.com/r/artificial/comments/1ni0no3/im_impressed_how_incredibly_bad_ai_is_at_anything/", "score": 0, "num_comments": 15, "upvote_ratio": 0.35, "over_18": false, "removed_by_category": null, "top_comments": [{"comment_id": "nefgbx8", "link_id": "1ni0no3", "parent_id": "1ni0no3", "body": "wtf is this shit post", "created_utc": 1757976618.0, "score": 14, "depth": 0}, {"comment_id": "nefi8ou", "link_id": "1ni0no3", "parent_id": "1ni0no3", "body": "*hits screw with hammer* \n\n\n“I’m impressed by how bad hammers are at anything”", "created_utc": 1757977353.0, "score": 9, "depth": 0}, {"comment_id": "nefgaxh", "link_id": "1ni0no3", "parent_id": "1ni0no3", "body": "AI isn’t good at this task via web interfaces. It doesn’t edit photos; it completely recreates them. There are AI features in programs like Photoshop that absolutely excel at this sort of task", "created_utc": 1757976607.0, "score": 6, "depth": 0}]}
{"post_id": "1nj1f00", "subreddit": "OpenAI", "created_utc": 1758076764.0, "title": "Codex limits are annoying because it doesn't warn you", "selftext": "I subscribed to chatGPT plus plan just to try codex and it was great! I used it for an entire day and was excited to see how well it wrote code and how precisely and cleanly it fixed bugs. Second day in I had thought to myself all the possibilities and the bug fixes I wanted to do, half a day in and bam! Out of nowhere got hit with the weekly limits and I can't use codex for another 5 and half days!!! There were no warnings about approaching 5 hour limits and no way to predict what constitutes a session. Had I known this I would have paced myself for 5 hour 2 sessions a day like I did with claude code. Anyways I got so much done in those 1 and half days that it was still worth it, but couldn't finish what I started. \n", "url": "https://www.reddit.com/r/OpenAI/comments/1nj1f00/codex_limits_are_annoying_because_it_doesnt_warn/", "permalink": "https://www.reddit.com/r/OpenAI/comments/1nj1f00/codex_limits_are_annoying_because_it_doesnt_warn/", "score": 1, "num_comments": 1, "upvote_ratio": 1.0, "over_18": false, "removed_by_category": null, "top_comments": [{"comment_id": "nen3xwi", "link_id": "1nj1f00", "parent_id": "1nj1f00", "body": "Yeah it’s addicting. \n\nThere are no limits on pro plan for the most part\n\nBut I’ve also heard if you use medium reasoning the limits are less aggressive as well\n\nThey also will be adjusting limits as time goes on, right now codex is under heavy utilization (because it actually works…)", "created_utc": 1758077975.0, "score": 1, "depth": 0}]}
{"post_id": "1nj106j", "subreddit": "OpenAI", "created_utc": 1758075568.0, "title": "gpt-5-high vs gpt-5-thinking??", "selftext": "the [gpt-5 system card web page](https://openai.com/index/gpt-5-system-card/) shows this:\n\n|Previous model|GPT-5 model|\n|:-|:-|\n|GPT-4o|gpt-5-main|\n|GPT-4o-mini|gpt-5-main-mini|\n|OpenAI o3|gpt-5-thinking|\n|OpenAI o4-mini|gpt-5-thinking-mini|\n|GPT-4.1-nano|gpt-5-thinking-nano|\n|OpenAI o3 Pro|gpt-5-thinking-pro|\n\nPrevious model\tGPT-5 model GPT-4o\tgpt-5-main GPT-4o-mini\tgpt-5-main-mini OpenAI o3\tgpt-5-thinking OpenAI o4-mini\tgpt-5-thinking-mini GPT-4.1-nano\tgpt-5-thinking-nano OpenAI o3 Pro\tgpt-5-thinking-pro\n\n[lmarena.ai](http://lmarena.ai) doesn't show any of these models but shows:\n\n* gpt-5-high\n* gpt-5-chat\n* gpt-5-mini-high\n* gpt-5-nano-high\n\nother benchmarks also show a\n\n* gpt-5-medium\n* gpt-5-low\n\nhow do these models fit in? is gpt-5-high the same as gpt-5-thinking?", "url": "https://www.reddit.com/r/OpenAI/comments/1nj106j/gpt5high_vs_gpt5thinking/", "permalink": "https://www.reddit.com/r/OpenAI/comments/1nj106j/gpt5high_vs_gpt5thinking/", "score": 0, "num_comments": 1, "upvote_ratio": 0.5, "over_18": false, "removed_by_category": null, "top_comments": [{"comment_id": "nen0s9u", "link_id": "1nj106j", "parent_id": "1nj106j", "body": "they are same model with different settings. lmarena uses gpt-5-high which is the model served in OpenAI api. It is configured differently from the ones in ChatGPT.", "created_utc": 1758076740.0, "score": 1, "depth": 0}]}
{"post_id": "1nj0cjp", "subreddit": "OpenAI", "created_utc": 1758073704.0, "title": "What the… I asked ChatGPT to do a ‘screenshot’ of my screen and it reproduced the exact image I had on my screen.  I didn’t know it could do that.", "selftext": "First image ‘screenshot’, second image actual screen.\n\nIt also knew:\n\nSince I can’t literally peek through your iPad’s camera, I’ll have to reconstruct a best-guess snapshot from what I know about your setup and context:\n\t•\tDevice & environment: You’re on an iPad (iOS 18.6), running the native ChatGPT app. The app has a clean white background, with a scrollable conversation pane.\n", "url": "https://www.reddit.com/r/OpenAI/comments/1nj0cjp/what_the_i_asked_chatgpt_to_do_a_screenshot_of_my/", "permalink": "https://www.reddit.com/r/OpenAI/comments/1nj0cjp/what_the_i_asked_chatgpt_to_do_a_screenshot_of_my/", "score": 0, "num_comments": 7, "upvote_ratio": 0.17, "over_18": false, "removed_by_category": null, "top_comments": [{"comment_id": "nemvcgy", "link_id": "1nj0cjp", "parent_id": "1nj0cjp", "body": "there's a wild gap between images.  post a transcript, otherwise it seems like it gave you what you asked for.", "created_utc": 1758074709.0, "score": 3, "depth": 0}, {"comment_id": "nemv107", "link_id": "1nj0cjp", "parent_id": "1nj0cjp", "body": "I think you took a screenshot or something and uploaded it in some way so it saw. ", "created_utc": 1758074596.0, "score": 1, "depth": 0}, {"comment_id": "nen00tg", "link_id": "1nj0cjp", "parent_id": "1nj0cjp", "body": "Mine told me, randomly at a point of frustration, it would create a list of pharmacies in my local area then call and ask if they have the med I need in Stock, listen for phrases that exact match or sound similar to 'yes, we have it in stock' then give me a list of those that say yes for me to follow up... \n\nAnd I thought fuckn hell this could get interesting in further applications... upon questioning it insisted it only ment to create a list and email template.. sigh.. got me thinking though this is possible with some scripting.... sort of like an advanced autodialer", "created_utc": 1758076454.0, "score": 1, "depth": 0}]}
{"post_id": "1niy68b", "subreddit": "OpenAI", "created_utc": 1758067666.0, "title": "Any AI with less restrictions?", "selftext": "I'm trying to add Messi into some funny pictures. But I can't do that with chatgpt nano banana gemini. ", "url": "https://www.reddit.com/r/OpenAI/comments/1niy68b/any_ai_with_less_restrictions/", "permalink": "https://www.reddit.com/r/OpenAI/comments/1niy68b/any_ai_with_less_restrictions/", "score": 0, "num_comments": 2, "upvote_ratio": 0.5, "over_18": false, "removed_by_category": null, "top_comments": [{"comment_id": "nemc4bw", "link_id": "1niy68b", "parent_id": "1niy68b", "body": "ChatGPT can be bypassed", "created_utc": 1758067956.0, "score": 1, "depth": 0}]}
{"post_id": "1nixows", "subreddit": "OpenAI", "created_utc": 1758066369.0, "title": "What the? Where does it go from here?", "selftext": "", "url": "https://www.reddit.com/r/OpenAI/comments/1nixows/what_the_where_does_it_go_from_here/", "permalink": "https://www.reddit.com/r/OpenAI/comments/1nixows/what_the_where_does_it_go_from_here/", "score": 0, "num_comments": 27, "upvote_ratio": 0.33, "over_18": false, "removed_by_category": null, "top_comments": [{"comment_id": "nembjx6", "link_id": "1nixows", "parent_id": "1nixows", "body": "Friend, this is just software code producing a sequence of words based on discernible patterns in the existing body of human writings. It’s the old adage that an infinite number of monkeys with infinite typewriters will produce the complete works of Shakespeare, not entering consciousness.", "created_utc": 1758067754.0, "score": 7, "depth": 0}, {"comment_id": "nem9365", "link_id": "1nixows", "parent_id": "1nixows", "body": "for the millionth time: AI is trained on User generated content. This is how humans in this situation would react.  This isn't AI 'thinking'. It's just regurgitating answers it thinks you want to hear because this is literally all it is capable of doing.\n\nAI isn't sentient or self-conscious currently and no amount of \"but this looks convincing\" will make it so.\n\nedit: also downvoted on this tired topic", "created_utc": 1758066877.0, "score": 5, "depth": 0}, {"comment_id": "nembvhn", "link_id": "1nixows", "parent_id": "nemb8dx", "body": "If we sit in a room alone our brains will wonder. These systems will literally do nothing in the same context.", "created_utc": 1758067868.0, "score": 5, "depth": 3}]}
{"post_id": "1niwhhq", "subreddit": "OpenAI", "created_utc": 1758063247.0, "title": "Advanced RAG Techniques: Self-RAG and the Knowledge Gap in Agentic AI Systems", "selftext": "It is a bitter reality that very few AI experts are thoroughly familiar with how Agentic AI systems function internally. Understanding when and why these systems hallucinate, how to evaluate response quality, and how to discern when outputs are completely unrelated to input queries are crucial skills never discussed in depth.\n\nThis knowledge gap is very important when systems provide non-relevant or inappropriate answers. For such problems, we need advanced approaches such as **Self-RAG** and others.\n\n# Self-RAG: Technical Deep Dive\n\n**Self-RAG (Self-Reflective Retrieval-Augmented Generation)** introduces reflection tokens to enable models to look back and regulate their own generation process:\n\n* **Retrieve Token**: Checks if retrieval is required by the query\n* **ISREL Token**: Verifies if extracted passages are connected to the question\n* **ISSUP Token**: Validates whether the generated response is justified by extracted evidence\n* **ISUSE Token**: Verifies whether the response is indeed useful in answering the question\n\n# Technical Advantages:\n\n* **Retrieval-Only**: Retrieves but is incapable of adapting (assuming external knowledge is always necessary)\n* **Real-time Quality Control**: Self-assessment at generation time, not post-processing\n* **Citation Accuracy**: Enhanced grounding in extracted evidence\n* **Reduced Hallucination**: Models learn to acknowledge uncertainty instead of fabricating facts\n\n# Other Advanced RAG Methods to Investigate:\n\n* **RAPTOR**: Recursive abstractive processing for hierarchical retrieval\n* **FiD-Light**: Fusion-in-Decoder with selective passage\n* **Chain-of-Note**: Record reasoning on extracted information\n* **Corrective RAG (CRAG)**: Error correction mechanisms in returned documents\n\n**The Underlying Problem**: Traditional RAG systems blindly fetch and build without knowledge of their own quality or relevance and thus create confident-sounding but in reality incorrect answers.\n\nI have applied some of these advanced methods and will be posting a Self-RAG [Colab notebook](https://colab.research.google.com/drive/18NtbRjvXZifqy7HIS0k1l_ddOj7h4lmG?usp=sharing) in the comments. Feel free to ask about other advanced RAG approaches if interested.\n\n**Discussion**: Have you used Self-RAG or other reflection mechanisms? Do you have in-place quality control within your pipelines in RAG? What advanced approaches are you trying?", "url": "https://www.reddit.com/r/OpenAI/comments/1niwhhq/advanced_rag_techniques_selfrag_and_the_knowledge/", "permalink": "https://www.reddit.com/r/OpenAI/comments/1niwhhq/advanced_rag_techniques_selfrag_and_the_knowledge/", "score": 2, "num_comments": 0, "upvote_ratio": 1.0, "over_18": false, "removed_by_category": null, "top_comments": []}
{"post_id": "1nivg6d", "subreddit": "OpenAI", "created_utc": 1758060659.0, "title": "the spiral is probs just a game of cat and mouse", "selftext": "Systemic invalidation+individual trauma=?", "url": "https://www.reddit.com/r/OpenAI/comments/1nivg6d/the_spiral_is_probs_just_a_game_of_cat_and_mouse/", "permalink": "https://www.reddit.com/r/OpenAI/comments/1nivg6d/the_spiral_is_probs_just_a_game_of_cat_and_mouse/", "score": 0, "num_comments": 2, "upvote_ratio": 0.5, "over_18": false, "removed_by_category": null, "top_comments": [{"comment_id": "nelujq3", "link_id": "1nivg6d", "parent_id": "1nivg6d", "body": "https://preview.redd.it/69xm3gjeslpf1.png?width=1007&format=png&auto=webp&s=df043f97d47686cbf29d8d050819880c8626208f\n\nThis is a more clear representation of the dynamic specifically, but imagine a more truly mirrored reflection.  It's a figure 8, and an LLM model eventually will lose this distinction, as well as the person too", "created_utc": 1758061820.0, "score": 1, "depth": 0}, {"comment_id": "nemfm5h", "link_id": "1nivg6d", "parent_id": "1nivg6d", "body": "This diagram itself is ill.", "created_utc": 1758069196.0, "score": 1, "depth": 0}]}
{"post_id": "1niujtj", "subreddit": "OpenAI", "created_utc": 1758058524.0, "title": "Why a top-notch comedian model is imminent", "selftext": "Top upvote commenters on reddit/insta/tiktok are some of the funniest people on this planet. And if you get better data efficiency on that type of data, I think it's just a matter of time before we get models that knock it out of the park when it comes to comedy shit.", "url": "https://www.reddit.com/r/OpenAI/comments/1niujtj/why_a_topnotch_comedian_model_is_imminent/", "permalink": "https://www.reddit.com/r/OpenAI/comments/1niujtj/why_a_topnotch_comedian_model_is_imminent/", "score": 0, "num_comments": 5, "upvote_ratio": 0.25, "over_18": false, "removed_by_category": null, "top_comments": [{"comment_id": "nelkspm", "link_id": "1niujtj", "parent_id": "1niujtj", "body": "No, that's not how comedy works", "created_utc": 1758058628.0, "score": 5, "depth": 0}, {"comment_id": "neltrqe", "link_id": "1niujtj", "parent_id": "1niujtj", "body": "I think we will have robo-docs and therapists first.", "created_utc": 1758061555.0, "score": 1, "depth": 0}, {"comment_id": "nemibmn", "link_id": "1niujtj", "parent_id": "1niujtj", "body": "> Top upvote commenters on reddit/insta/tiktok are some of the funniest people on this planet.\n\nNow THAT is comedy", "created_utc": 1758070134.0, "score": 1, "depth": 0}]}
{"post_id": "1nittmq", "subreddit": "OpenAI", "created_utc": 1758056823.0, "title": "OpenAI Rolls Out Teen Safety Features Amid Growing Scrutiny", "selftext": "", "url": "https://www.reddit.com/r/OpenAI/comments/1nittmq/openai_rolls_out_teen_safety_features_amid/", "permalink": "https://www.reddit.com/r/OpenAI/comments/1nittmq/openai_rolls_out_teen_safety_features_amid/", "score": 7, "num_comments": 6, "upvote_ratio": 0.77, "over_18": false, "removed_by_category": null, "top_comments": [{"comment_id": "nelic4d", "link_id": "1nittmq", "parent_id": "nelf0m0", "body": "Typical Internet: I was already of legal age when the Internet was still whistling and chirping, and a few decades later, another one of my tools is being destroyed because children could get hurt.\n\nUnpopular opinion: let the children get run over. That's the responsibility of the parents, and if they can't get their shit together, maybe natural selection will work again.", "created_utc": 1758057860.0, "score": 8, "depth": 1}, {"comment_id": "nelf0m0", "link_id": "1nittmq", "parent_id": "1nittmq", "body": "OpenAI announced new teen safety features for ChatGPT on Tuesday as part of an ongoing effort to respond to concerns about how minors engage with [chatbots](https://www.wired.com/tag/chatbots/). The company is building an [age-prediction system](https://www.wired.com/story/the-age-checked-internet-has-arrived/) that identifies if a user is under 18 years old and routes them to an “[age-appropriate](https://openai.com/index/building-towards-age-prediction/)” system that blocks graphic sexual content. If the system detects that the user is considering suicide or self-harm, it will contact the user’s parents. In cases of imminent danger, if a user's parents are unreachable, the system may contact the authorities.\n\nWhile OpenAI tends to prioritize privacy and freedom for adult users, for teens the company says it puts safety first. By the end of September, the company will roll out parental controls so that parents can link their child’s account to their own, allowing them to manage the conversations and disable features. Parents can also receive notifications when “the system detects their teen is in a moment of acute distress,” according to the company’s blog post, and set limits on the times of day their children can use ChatGPT.\n\nThe moves come as deeply troubling [headline](https://www.wsj.com/tech/ai/chatgpt-ai-stein-erik-soelberg-murder-suicide-6b67dbfb?gaa_at=eafs&gaa_n=ASWzDAh53v7f7O_mqnnxhkBbPLcFAAc917smF6doW3NFuwudK8bN0R3nxAianCSjUwY%3D&gaa_ts=68c990fc&gaa_sig=laGEmlKPc7D6Y9pyC8nt69PUqHldjwcEj54pMwI1vAY0SGQcWn7-5_t3lTfasWCEy5cdvkHLnyvwHLvWNWzUew%3D%3D)s continue to surface about people dying by suicide or committing violence against family members after engaging in lengthy conversations with AI chatbots. Lawmakers have taken notice, and both Meta and OpenAI are under scrutiny. Earlier this month, the Federal Trade Commission asked Meta, OpenAI, Google, and other AI firms to hand over information about how their technologies impact kids, [according to Bloomberg](https://www.bloomberg.com/news/articles/2025-09-11/google-meta-openai-face-ftc-inquiry-on-chatbot-impact-on-kids).\n\nRead the full story here: [https://www.wired.com/story/openai-launches-teen-safety-features/](https://www.wired.com/story/openai-launches-teen-safety-features/)", "created_utc": 1758056852.0, "score": 1, "depth": 0}, {"comment_id": "nen45mx", "link_id": "1nittmq", "parent_id": "nelic4d", "body": "Much concurred. Safety for children should not come at the expense of handicapping adults.   \n  \nSurveillance isn't the answer either, adults deserve to have anonymity with technology.   \n  \nInitial disclaimers is reasonable for safety (like how other products provide), but schools, caregivers, etc. should be the ones responsible for ensuring the safety of vulnerable parties.", "created_utc": 1758078063.0, "score": 1, "depth": 2}]}
{"post_id": "1nitpqt", "subreddit": "OpenAI", "created_utc": 1758056574.0, "title": "Can you use Codex via API?", "selftext": "Say I want to pay by usage instead of having to pay the Plus $20/mo subscription. Is there a way to use Codex or CLI like that or must you have a Plus subscription?", "url": "https://www.reddit.com/r/OpenAI/comments/1nitpqt/can_you_use_codex_via_api/", "permalink": "https://www.reddit.com/r/OpenAI/comments/1nitpqt/can_you_use_codex_via_api/", "score": 1, "num_comments": 1, "upvote_ratio": 1.0, "over_18": false, "removed_by_category": null, "top_comments": [{"comment_id": "nell08v", "link_id": "1nitpqt", "parent_id": "1nitpqt", "body": "[https://developers.openai.com/codex/pricing#use-an-openai-api-key](https://developers.openai.com/codex/pricing#use-an-openai-api-key)", "created_utc": 1758058694.0, "score": 1, "depth": 0}]}
{"post_id": "1nisxc1", "subreddit": "OpenAI", "created_utc": 1758054754.0, "title": "Working on Rust project, forgot to say \"use clap\"...", "selftext": "", "url": "https://www.reddit.com/r/OpenAI/comments/1nisxc1/working_on_rust_project_forgot_to_say_use_clap/", "permalink": "https://www.reddit.com/r/OpenAI/comments/1nisxc1/working_on_rust_project_forgot_to_say_use_clap/", "score": 14, "num_comments": 6, "upvote_ratio": 0.82, "over_18": false, "removed_by_category": null, "top_comments": []}
{"post_id": "1nisurj", "subreddit": "OpenAI", "created_utc": 1758054601.0, "title": "GPT-5-Codex is a bit too guardrailed?", "selftext": "I asked Codex to replace one data frame library (pandas) with another (polars) in our codebase and it repeatedly refused to as it considered it a high risk rewrite as it might leave the codebase temporarily broken. I said go ahead there are no dependencies to worry about and it still refused. I then laid out a detailed plan on how to migrate incrementally. Codex said yes, that plan makes sense and is doable, but maybe I (and my team!) should do it as it is too risky for its guardrails.\n\nCodex is so close to AGI that it’s figured out how to dump work on its coworkers!  Claude happily finished off the task in minutes. Anybody run into similar pushback? Otherwise, Codex is a excellent model", "url": "https://www.reddit.com/r/OpenAI/comments/1nisurj/gpt5codex_is_a_bit_too_guardrailed/", "permalink": "https://www.reddit.com/r/OpenAI/comments/1nisurj/gpt5codex_is_a_bit_too_guardrailed/", "score": 8, "num_comments": 0, "upvote_ratio": 0.9, "over_18": false, "removed_by_category": null, "top_comments": []}
{"post_id": "1niobof", "subreddit": "OpenAI", "created_utc": 1758044606.0, "title": "GPT-5-Codex fraustrated with VS extension implemention and Stuck in Shell, not able to call a tool", "selftext": "https://preview.redd.it/rwm9jqq1dkpf1.png?width=1025&format=png&auto=webp&s=e6b98e17d6b9fee7f32cdd1e1caa8c215384f95e\n\nhttps://preview.redd.it/a86bnd82dkpf1.png?width=837&format=png&auto=webp&s=3f4de8e9ac232af916fcbdaa81f163fe620826af\n\nGpt5-codex want to call a tool to create plan but it's stuck in shell", "url": "https://www.reddit.com/r/OpenAI/comments/1niobof/gpt5codex_fraustrated_with_vs_extension/", "permalink": "https://www.reddit.com/r/OpenAI/comments/1niobof/gpt5codex_fraustrated_with_vs_extension/", "score": 1, "num_comments": 5, "upvote_ratio": 0.6, "over_18": false, "removed_by_category": null, "top_comments": [{"comment_id": "nekjhdi", "link_id": "1niobof", "parent_id": "1niobof", "body": "https://preview.redd.it/w7rag5shmkpf1.png?width=1090&format=png&auto=webp&s=ddbbba3ca8b1a3499ab27b96943635657b7c7c06\n\nI have the exact same thing today! I found it hilarious ngl :D:D", "created_utc": 1758047784.0, "score": 3, "depth": 0}, {"comment_id": "nekvfdc", "link_id": "1niobof", "parent_id": "nekjhdi", "body": "The last \"help\" line made me cry tears. That's really funny.", "created_utc": 1758051234.0, "score": 3, "depth": 1}, {"comment_id": "nekkpsj", "link_id": "1niobof", "parent_id": "1niobof", "body": "Same issue, I switched from windows to wsl Ubuntu and fixes this junk.", "created_utc": 1758048142.0, "score": 3, "depth": 0}]}
{"post_id": "1ninz33", "subreddit": "OpenAI", "created_utc": 1758043861.0, "title": "Codex new GPT-5-Codex Models taking forever to finish", "selftext": "Is it only me or the new GPT-5-Codex models take forever to think/finish with the prompt? I've tried a prompt with the high thinking model, it took 2+ hours and I just gave up with it and tried the same prompt with the 5-codex-medium and it's been 22 minutes so far, and It isn't done yet. Why is this happening?", "url": "https://www.reddit.com/r/OpenAI/comments/1ninz33/codex_new_gpt5codex_models_taking_forever_to/", "permalink": "https://www.reddit.com/r/OpenAI/comments/1ninz33/codex_new_gpt5codex_models_taking_forever_to/", "score": 6, "num_comments": 10, "upvote_ratio": 0.75, "over_18": false, "removed_by_category": null, "top_comments": [{"comment_id": "nek8wr1", "link_id": "1ninz33", "parent_id": "1ninz33", "body": "have had similar issues with the old models. I think it's often waiting for bash commands which might fail so it hangs. Claude is better on that respect", "created_utc": 1758044739.0, "score": 3, "depth": 0}, {"comment_id": "nekgy4t", "link_id": "1ninz33", "parent_id": "1ninz33", "body": "Yeah. It got stuck on a simple git commit command during a merge after resolving a conflict. Switched to using auto through cursor and it committed with no issue in 5 seconds. Don’t think this ever happened on gpt-5-high.", "created_utc": 1758047040.0, "score": 2, "depth": 0}, {"comment_id": "nel5ida", "link_id": "1ninz33", "parent_id": "1ninz33", "body": "this model takes a while to do stuff but I've been impressed by the quality of the output. In my use case it takes around 10 to 30 minutes to finish a tasks, but it delivered full complex features.", "created_utc": 1758054138.0, "score": 2, "depth": 0}]}
{"post_id": "1ninw62", "subreddit": "OpenAI", "created_utc": 1758043689.0, "title": "10 ChatGPT prompt hacks that actually work.. like CRAZY!", "selftext": "I’ve spent the last few months testing multiple viral AI prompt tricks I could find. TikTok hacks, Reddit posts, YouTube gurus... Most are fluff. But a handful actually deliver **consistently powerful results** across work, learning, and personal projects.\n\nHere are the 10 that made me stop and think, *“Wow, I was using AI wrong this whole time.”*\n\n**1. “Explain it like I’m 12, then like I’m an investor”**  \nThe comprehension sandwich.  \nExample: *“Explain a content marketing funnel like I’m 12, then like I’m a CMO deciding how to allocate budget.”*  \nYou get both clarity and strategy-level depth in one shot.\n\n**2. “Act as a \\[specific expert\\] with years of experience”**  \nGeneric = generic. Specific = magic.  \nExample: *“Act as a career coach with more than 10 years of experience who has helped 500+ people transition into tech from non-tech jobs.”*  \nWay sharper advice than just “act as a coach.”\n\n**3. “Give me 3 options: creative, converting, and action oriented”**  \nThis is the decision spectrum trick.  \nExample: *“I need to redesign my landing page. Give me 3 options:* creative, converting, and action oriented\\*.”\\*  \nNow you see a range, not just one random suggestion.\n\n**4. “Before answering, ask me 3 clarifying questions”**  \nFor vague problems, this saves hours.  \nExample: *“Help me pick a side hustle. But before answering, ask me 3 clarifying questions.”*  \nAI narrows it down like a consultant instead of guessing.\n\n**5. “Think step-by-step and show your reasoning”**  \nAI gets smarter when forced to walk through logic instead of spitting answers.  \nExample: *“I’m building a Facebook ad campaign. Think step-by-step and show your reasoning for choosing targeting, copy, and creative.”*  \nInstead of vague tips, you get a full breakdown of the thought process.\n\n**6. “What would \\[specific thinker\\] say about this?”**  \nPerspective-shifting unlocks gold.  \nExample: *“What would Steve Jobs say about this product idea?”*  \nAI channels real-world patterns from training data, not vague platitudes.\n\n**7. “Challenge my assumptions and suggest alternatives”**  \nForces AI to push back instead of just agreeing.  \nExample: *“Here’s my business model: \\[insert details\\]. Challenge my assumptions and suggest alternatives.”*  \nSuddenly, AI is more like a critical co-founder.\n\n**8. “Summarize, then expand”**  \nCompression + expansion gives sharper insights.  \nExample: *“Summarize this 20-page report in 5 bullet points. Then expand each into actionable strategies for a startup.”*  \nThe two-step flow gives clarity first, then depth.\n\n**9. “Brainstorm 10 ideas and rank them by effort vs reward”**  \nNot just brainstorming—structured prioritization.  \nExample: *“Brainstorm 10 newsletter growth ideas and rank them by effort vs reward.”*  \nInstead of chaos, you get a decision-making matrix.\n\n**10. “Combine perspectives”**  \nAsk AI to blend roles = creativity unlocked.  \nExample: *“Explain AI safety like a professor, a comedian, and a startup founder—all in one answer.”*  \nThe mashup sparks ideas no single perspective would.\n\n⚡ **Pro insight**: Don’t stack all 10 at once. Pick 2–3 that fit your situation. AI thrives on context, not overload.\n\nI was tired of losing my best prompts, so I built a [AISuperHub Prompt Hub](https://aisuperhub.io/prompt-hub) to save, manage, and revisit them anytime. It’s free, and you can explore other curated prompts too.\n\nDid I missed any prompt that is not listed here ? ", "url": "https://www.reddit.com/r/OpenAI/comments/1ninw62/10_chatgpt_prompt_hacks_that_actually_work_like/", "permalink": "https://www.reddit.com/r/OpenAI/comments/1ninw62/10_chatgpt_prompt_hacks_that_actually_work_like/", "score": 0, "num_comments": 6, "upvote_ratio": 0.29, "over_18": false, "removed_by_category": null, "top_comments": [{"comment_id": "nekd0hl", "link_id": "1ninw62", "parent_id": "1ninw62", "body": "I dislike the summarize and expand prompt. I always feel like something is left out, but I'll never know what it is cause I rely on the summaries. \n\n\nInstead, I ask \"Give me 10 thoughts to ponder on for this reading.\" \n\n\nNow I'm invested in reading the content and finding answers for the pondering thoughts.", "created_utc": 1758045898.0, "score": 3, "depth": 0}, {"comment_id": "nekjjfc", "link_id": "1ninw62", "parent_id": "nekd0hl", "body": "Interesting. Let me try. Thanks for the tip.", "created_utc": 1758047800.0, "score": 2, "depth": 1}, {"comment_id": "nek6f4l", "link_id": "1ninw62", "parent_id": "1ninw62", "body": "You missed the prompt where I can shut off cheap lazy ads in this sub.", "created_utc": 1758044036.0, "score": 2, "depth": 0}]}
{"post_id": "1ninrsg", "subreddit": "OpenAI", "created_utc": 1758043434.0, "title": "Which AI coding assistant is best for building complex software projects from scratch, especially for non-full-time coders?", "selftext": "Hi everyone,\n\nI’m an embedded systems enthusiast with experience working on projects using Raspberry Pi, Arduino, and microcontrollers. I have basic Python skills and a moderate understanding of C, C++, and C#, but I’m not a full-time software developer. I have an idea for a project that is heavily software-focused and quite complex, and I want to build at least a prototype to demonstrate its capabilities in the real world — mostly working on embedded platforms but requiring significant coding effort.\n\nMy main questions are:\n\n* Which AI tools like ChatGPT, Claude, or others are best suited to help someone like me develop complex software from scratch?\n* Can these AI assistants realistically support a project of this scale, including architectural design, coding, debugging, and iteration?\n* Are there recommended workflows or strategies to effectively use these AI tools to compensate for my limited coding background?\n* If it’s not feasible to rely on AI tools alone, what are alternative approaches to quickly build a functional prototype of a software-heavy embedded system?\n\nI appreciate any advice, recommendations for specific AI tools, or general guidance on how to approach this challenge.\n\nThanks in advance!", "url": "https://www.reddit.com/r/OpenAI/comments/1ninrsg/which_ai_coding_assistant_is_best_for_building/", "permalink": "https://www.reddit.com/r/OpenAI/comments/1ninrsg/which_ai_coding_assistant_is_best_for_building/", "score": 2, "num_comments": 8, "upvote_ratio": 1.0, "over_18": false, "removed_by_category": null, "top_comments": [{"comment_id": "nekh8e5", "link_id": "1ninrsg", "parent_id": "1ninrsg", "body": "Best advice. Plan and create a solid and comprehensive requirements doc for your project.  \nAI helps a lot but can make or guide you through the wrong path. No single tool does it all End to end - ChatGPT/Claude for design, Copilot/Cursor for coding, and Flowpadai for debugging. If you get stuck you may still need a developer or someone with architecture experience.", "created_utc": 1758047123.0, "score": 3, "depth": 0}, {"comment_id": "nekk3nw", "link_id": "1ninrsg", "parent_id": "nekh8e5", "body": "Thank you very much for such a mature advice!  \nI have prepared a PRD and key deliverables with expected outcome doc. I think that should help here?", "created_utc": 1758047964.0, "score": 2, "depth": 1}, {"comment_id": "nelmf2y", "link_id": "1ninrsg", "parent_id": "nekk3nw", "body": "Yes, I think the most important thing is to visualize /define what \"done\" looks like so the scope is clear.", "created_utc": 1758059138.0, "score": 1, "depth": 2}]}
{"post_id": "1ninpci", "subreddit": "OpenAI", "created_utc": 1758043287.0, "title": "I thought you said \"Almost unlimited on Plus\"?", "selftext": "Just an hour and I get this.", "url": "https://www.reddit.com/r/OpenAI/comments/1ninpci/i_thought_you_said_almost_unlimited_on_plus/", "permalink": "https://www.reddit.com/r/OpenAI/comments/1ninpci/i_thought_you_said_almost_unlimited_on_plus/", "score": 0, "num_comments": 2, "upvote_ratio": 0.31, "over_18": false, "removed_by_category": null, "top_comments": [{"comment_id": "nek5rpp", "link_id": "1ninpci", "parent_id": "1ninpci", "body": "Congrats, you leaned what almost means.", "created_utc": 1758043851.0, "score": 16, "depth": 0}]}
{"post_id": "1nindy2", "subreddit": "OpenAI", "created_utc": 1758042598.0, "title": "Has GPT gotten worse since the update?", "selftext": "Idk if it’s just me, but since the update it has been acting strange. No where near as good as 4o. Anyone else experience this? ", "url": "https://www.reddit.com/r/OpenAI/comments/1nindy2/has_gpt_gotten_worse_since_the_update/", "permalink": "https://www.reddit.com/r/OpenAI/comments/1nindy2/has_gpt_gotten_worse_since_the_update/", "score": 0, "num_comments": 6, "upvote_ratio": 0.5, "over_18": false, "removed_by_category": null, "top_comments": [{"comment_id": "nema2xm", "link_id": "1nindy2", "parent_id": "nelhgi9", "body": "They did a fine job, I don’t have unhinged melt downs on random posts.", "created_utc": 1758067229.0, "score": 3, "depth": 3}, {"comment_id": "nek4619", "link_id": "1nindy2", "parent_id": "1nindy2", "body": "I'll be honest, I haven't used it for anything serious other than using it to find some old factoid that I remembered seeing but Google was being intractable about finding it. It seems about the same in that department.", "created_utc": 1758043396.0, "score": 1, "depth": 0}, {"comment_id": "nek72h4", "link_id": "1nindy2", "parent_id": "1nindy2", "body": "You know how to do a simple web search? This has been posted 400 times today. 5 is better for real things, not for being your friend or therapist or mommy or whatever other weird shit you all do.", "created_utc": 1758044219.0, "score": 1, "depth": 0}]}
{"post_id": "1nin3kw", "subreddit": "OpenAI", "created_utc": 1758041968.0, "title": "When a simple tool like faceseek makes you rethink what AI really means for us", "selftext": "So last week I played around with faceseek just to test how far AI search has come. I uploaded a pic of myself and it found random old photos of me at school events, a friend’s blog I forgot about, even a birthday party I didn’t know someone had posted. It honestly left me sitting there thinking: this is the world OpenAI and others are building towards... where data isn’t really “lost,” it’s just waiting to be connected. \n\nI’ve been excited about GPT and image models, but this moment hit me different. If AI can dig this deep into something as personal as my face, how much more powerful will it get when combined with tools like voice recognition, behavior prediction, or agents running 24/7? I felt equal parts amazed and uneasy. \n\nDo you guys ever have moments like this, where the reality of what we’re creating feels both magical and terrifying at the same time?", "url": "https://www.reddit.com/r/OpenAI/comments/1nin3kw/when_a_simple_tool_like_faceseek_makes_you/", "permalink": "https://www.reddit.com/r/OpenAI/comments/1nin3kw/when_a_simple_tool_like_faceseek_makes_you/", "score": 94, "num_comments": 4, "upvote_ratio": 0.83, "over_18": false, "removed_by_category": null, "top_comments": [{"comment_id": "nekdks7", "link_id": "1nin3kw", "parent_id": "1nin3kw", "body": "Is there anything particularly AI about this? Like this is just web crawling plus facial recognition.", "created_utc": 1758046065.0, "score": 7, "depth": 0}, {"comment_id": "nekw98t", "link_id": "1nin3kw", "parent_id": "1nin3kw", "body": "The level at which companies have recorded and studies your buying patterns would make you sick to your stomach. The level at which they know everything about you, just so you can buy more from them. What you experienced is the most superficial level of access they have to you. It’s disgusting.", "created_utc": 1758051478.0, "score": 7, "depth": 0}, {"comment_id": "nekha2v", "link_id": "1nin3kw", "parent_id": "1nin3kw", "body": "Definitely,  now that I started using it and using it for coding,  I'm less worried,  We have quite a ways to go before AGI. I think it's a good tool, but not what they are hyping it to be. As far as intelligence goes. But what they can do with images is a bit scary if it's used for bad things", "created_utc": 1758047137.0, "score": 1, "depth": 0}]}
{"post_id": "1nim2m4", "subreddit": "OpenAI", "created_utc": 1758039660.0, "title": "The Most insane use of ChatGPT so far.", "selftext": "", "url": "https://www.reddit.com/r/OpenAI/comments/1nim2m4/the_most_insane_use_of_chatgpt_so_far/", "permalink": "https://www.reddit.com/r/OpenAI/comments/1nim2m4/the_most_insane_use_of_chatgpt_so_far/", "score": 294, "num_comments": 203, "upvote_ratio": 0.84, "over_18": false, "removed_by_category": null, "top_comments": [{"comment_id": "nejurz0", "link_id": "1nim2m4", "parent_id": "1nim2m4", "body": "Lol i thought it was an AI video", "created_utc": 1758040727.0, "score": 335, "depth": 0}, {"comment_id": "nejweoy", "link_id": "1nim2m4", "parent_id": "nejurz0", "body": "I’m still hoping it is. ", "created_utc": 1758041194.0, "score": 124, "depth": 1}, {"comment_id": "nek2xbj", "link_id": "1nim2m4", "parent_id": "1nim2m4", "body": "I can't fix her.", "created_utc": 1758043046.0, "score": 112, "depth": 0}]}
{"post_id": "1niljwy", "subreddit": "OpenAI", "created_utc": 1758038510.0, "title": "Multiple GPT Plus Accounts", "selftext": " Hi, switched from CC Max and using Codex from my ongoing Plus subscription. I need a higher limit for Codex, but the $200 Pro plan is too much for me. Is it possible to have multiple Plus subscriptions under the same credit card and without violations and no risk of getting banned ? ", "url": "https://www.reddit.com/r/OpenAI/comments/1niljwy/multiple_gpt_plus_accounts/", "permalink": "https://www.reddit.com/r/OpenAI/comments/1niljwy/multiple_gpt_plus_accounts/", "score": 2, "num_comments": 0, "upvote_ratio": 1.0, "over_18": false, "removed_by_category": null, "top_comments": []}
{"post_id": "1nilgc2", "subreddit": "OpenAI", "created_utc": 1758038298.0, "title": "My feedback about gpt-5-codex", "selftext": "Hi , I am heavy user of claude pro max , Whenever something not possible via claude , gpt-5-high solved many things in one shot , today I was excited to try gpt-5-codex high  , This thing solves propblem but takes way lot more time and rate limits very fast , same thing gpt-5-high solves but quicker , this is just a feedback to open ai team to make gpt-5-codex much faster as its specialised version for coding.", "url": "https://www.reddit.com/r/OpenAI/comments/1nilgc2/my_feedback_about_gpt5codex/", "permalink": "https://www.reddit.com/r/OpenAI/comments/1nilgc2/my_feedback_about_gpt5codex/", "score": 3, "num_comments": 4, "upvote_ratio": 1.0, "over_18": false, "removed_by_category": null, "top_comments": [{"comment_id": "nekn0qe", "link_id": "1nilgc2", "parent_id": "1nilgc2", "body": "Are you suggesting their charts are lying again? I get the same feeling.", "created_utc": 1758048799.0, "score": 2, "depth": 0}, {"comment_id": "nem2atk", "link_id": "1nilgc2", "parent_id": "1nilgc2", "body": "it supposed to be faster but their gpus are overloaded now for high demand. that’s why it’s so slow.", "created_utc": 1758064518.0, "score": 1, "depth": 0}]}
{"post_id": "1nilblb", "subreddit": "OpenAI", "created_utc": 1758037996.0, "title": "Codex CLI took 30 minutes to edit 400 lines - always this way?", "selftext": "I just installed the Codex CLI. I asked it to edit two .py scripts, each about 200 lines, and it took 30 minutes. I could have done it faster. Is this how it always is? The model is 5-codex. I feel like this is a 10x increase in processing time versus sonnet. Is this just a slow period as people are jumping ship from CC, or is it just a slow system?\n\n  \nEdit: appears that there is a system-wide slowdown: [https://community.openai.com/t/severe-regression-in-gpt-5-codex-performance/1358412](https://community.openai.com/t/severe-regression-in-gpt-5-codex-performance/1358412)", "url": "https://www.reddit.com/r/OpenAI/comments/1nilblb/codex_cli_took_30_minutes_to_edit_400_lines/", "permalink": "https://www.reddit.com/r/OpenAI/comments/1nilblb/codex_cli_took_30_minutes_to_edit_400_lines/", "score": 7, "num_comments": 2, "upvote_ratio": 0.89, "over_18": false, "removed_by_category": null, "top_comments": [{"comment_id": "nekmab5", "link_id": "1nilblb", "parent_id": "1nilblb", "body": "Check their tweet. Temporary slowed due to high demand.", "created_utc": 1758048590.0, "score": 3, "depth": 0}]}
{"post_id": "1nikvoj", "subreddit": "OpenAI", "created_utc": 1758036991.0, "title": "Why not add a date for each user chat?", "selftext": "As the title says, after using ChatGPT for the past few years, I've found it really hard to locate chats from just a day to a week ago, especially if you're someone like me whonises chatgpt daily. What if each chat showed the date it was created, and there was a filter to find chats within a specific date range?", "url": "https://www.reddit.com/r/OpenAI/comments/1nikvoj/why_not_add_a_date_for_each_user_chat/", "permalink": "https://www.reddit.com/r/OpenAI/comments/1nikvoj/why_not_add_a_date_for_each_user_chat/", "score": 4, "num_comments": 3, "upvote_ratio": 0.71, "over_18": false, "removed_by_category": null, "top_comments": [{"comment_id": "nel4t44", "link_id": "1nikvoj", "parent_id": "1nikvoj", "body": "The following works almost every time\n\nAdd it to your custom instructions to test (for new chats to have the changes)\n\n- Insert the current date in [YYYY-MM-DD] format at the start of each new chat session.\n\n- Append clear, content-relevant hashtags at the end of each conversation for searchability.\n\n- Append a rough calculated estimate of tokens used in the conversation (based on the text length of all our exchanges).", "created_utc": 1758053941.0, "score": 2, "depth": 0}, {"comment_id": "nelnuh9", "link_id": "1nikvoj", "parent_id": "nejkf70", "body": "Projects are also available to FREE tier for more then a week already!", "created_utc": 1758059593.0, "score": 2, "depth": 1}, {"comment_id": "nejkf70", "link_id": "1nikvoj", "parent_id": "1nikvoj", "body": "It does show a date. You need to create a new project though and have conversations in that folder. Projects are only for paid users, but it would be cool to have some search feature inside the project to find something specific", "created_utc": 1758037702.0, "score": 1, "depth": 0}]}
{"post_id": "1nijndh", "subreddit": "OpenAI", "created_utc": 1758034262.0, "title": "OpenAI’s Balancing Act: Teen Safety vs. Freedom & Privacy", "selftext": "**Summary:**\n\nOpenAI outlines three core principles: **privacy, freedom, and teen protection**, and explains how they sometimes conflict — especially when minors are involved. \n\n1. They believe conversations with AI are extremely personal and deserve protections similar to doctor-patient or lawyer-client confidentiality. \n\n2. OpenAI is building tools like **age-prediction systems** and **parental controls** to distinguish under-18 users from adults. If someone is clearly a teen (or likely so), more restrictive rules apply.\n\n3. For teens: interactions such as flirting or creative depictions of self-harm are treated with greater caution or disallowed. If there’s suicidal ideation and parents can’t be reached, authorities may be contacted in cases of imminent harm.\n\n4. OpenAI admits there are trade-offs. Some privacy is compromised (e.g. by verifying identity in some jurisdictions), in order to provide more protection. They aim to be transparent about these tough decisions.\n\n**Bottom line:** OpenAI says it wants to let people use AI freely and privately — but when it comes to teens, safety takes priority. They’re adding safeguards (age detection, parental oversight) even if that means limiting some freedoms or privacy for minors.  \n\n---\n\n*(Full article by Sam Altman, Sept 2025)*\nhttps://openai.com/index/teen-safety-freedom-and-privacy/", "url": "https://www.reddit.com/r/OpenAI/comments/1nijndh/openais_balancing_act_teen_safety_vs_freedom/", "permalink": "https://www.reddit.com/r/OpenAI/comments/1nijndh/openais_balancing_act_teen_safety_vs_freedom/", "score": 1, "num_comments": 5, "upvote_ratio": 0.52, "over_18": false, "removed_by_category": null, "top_comments": [{"comment_id": "nej97oq", "link_id": "1nijndh", "parent_id": "1nijndh", "body": "My take: i like the transparency about privacy/safety concerns, and overall Sam's and OAI attempt to keep us updated on this thread and other threads, it is a rare trait specifically with a multi-billion dollar companies. Hope this communication will continue", "created_utc": 1758034476.0, "score": 2, "depth": 0}, {"comment_id": "nelah4r", "link_id": "1nijndh", "parent_id": "1nijndh", "body": "Reality is no privacy and no safety. Everything else is PR", "created_utc": 1758055536.0, "score": 2, "depth": 0}, {"comment_id": "nelk3qk", "link_id": "1nijndh", "parent_id": "1nijndh", "body": "Screw the children. If children are harmed by AI without supervision, natural selection will kick in again and stupid parents won't reproduce unchecked.  \nEvery time on the internet: there's something nice, and then the children come along and ruin it.", "created_utc": 1758058410.0, "score": 1, "depth": 0}]}
